[
{"title": "Tracing Numbers on a Train", "product_description": "Start preparing children for classroom success with Tracing Numbers on a Train! This educational workbook is filled with pages of giant numbers that make it easy for little hands to learn pencil control, followed by pages of small numbers for repetition and motor skill development. The illustrated practice pages will keep kids engaged while learning their numbers from 1 to Start preparing children for classroom success with Tracing Numbers on a Train! This educational workbook is filled with pages of giant numbers that make it easy for little hands to learn pencil control, followed by pages of small numbers for repetition and motor skill development. The illustrated practice pages will keep kids engaged while learning their numbers from 1 to 30. ...more"},
{"title": "A Piece of Sky, a Grain of Rice: A Memoir in Four Meditations", "product_description": "In this layered collage of memory within memory, Hale recreates for readers her kaleidoscopic experience of a decades-long journey to acceptance and insight. Writer, prodigal daughter, single parent, Buddhist disciple, and, late in midlife, a newlywed, she is transformed through an unconventional relationship with a female spiritual teacher and an odd ritual of repeated ta In this layered collage of memory within memory, Hale recreates for readers her kaleidoscopic experience of a decades-long journey to acceptance and insight. Writer, prodigal daughter, single parent, Buddhist disciple, and, late in midlife, a newlywed, she is transformed through an unconventional relationship with a female spiritual teacher and an odd ritual of repeated tattooing with her two young adult children. Christine Hale's evocation of the bewildering complexities of life as a mother, daughter, wife (and ex-wife), and student of Buddhism is both a poem and a letter to those she has worked so long and hard to understand. On a journey that takes her through emotional and actual hurricanes, love and cruelty, urgent losses, and painful gains, she climbs to sometimes unnervingly high altitudes as she experiences the joy and the sorrow of samsara. In beautiful, clear language, Hale explores the wounds life gives us, the wounds we give ourselves, and the long process of healing. -Sarah Stone, author of The True Sources of the Nile Christine Hale is the author of a novel, Basil's Dream (Livingston Press 2009); National Book Award finalist Joan Silber says, Basil's Dream...seems to prove fiction can go where other forms can't. Ms. Hale's creative nonfiction has appeared in Arts & Letters, Spry, Still, Hippocampus, and Prime Number, among other journals. A fellow of MacDowell, Ucross, Hedgebrook, and the Virginia Center for the Creative Arts, she earned her MFA from Warren Wilson College. She teaches in the Antioch University-Los Angeles Low-Residency MFA Program as well as the Great Smokies Writing Program in Asheville, North Carolina, where she and her husband live. ...more"},
{"title": "The Bridge to Consciousness: I'm Writing the Bridge Between Science and Our Old and New Beliefs."},
{"title": "The Emerald Mystery", "product_description": "Three young adults are invited to spend a weekend at the exotic Timber Island. Maria is a professional in the sport of bodyboarding. Tina is an apprentice of the sport but very athletic, and she possesses other skills. And lastly there is Axell, a traveler and a veteran bodyboarder. For them, this invitation is extremely attractive because very few people have visited the Three young adults are invited to spend a weekend at the exotic Timber Island. Maria is a professional in the sport of bodyboarding. Tina is an apprentice of the sport but very athletic, and she possesses other skills. And lastly there is Axell, a traveler and a veteran bodyboarder. For them, this invitation is extremely attractive because very few people have visited the place, also known for its secret surf breaks. The adventure sounds irresistible, so they accept the challenge.Once all the guests are on the island, there is only one thing that worries Luis, their host and fellow bodyboarder: to venture out to find a stretch of secret coastline where the young man says they will face majestic wave no one has ever ridden.By this time all of the guests have encountered some very strange things ... and some question whether they are being watched by someone. But who may want to follow them to an island inhabited by only two people, and for what reason? Are these young riders prepared to solve this mystery and accept what they discover as they investigate? Luckily, you'll also be there to accompany them on their journey and reach your own conclusions in this exciting adventure. ...more"},
{"title": "The Secret (The Secret #1)", "product_description": "Fragments of a Great Secret have been found in the oral traditions, in literature, in religions and philosophies throughout the centuries. For the first time, all the pieces of The Secret come together in an incredible revelation that will be life-transforming for all who experience it. In this book, you'll learn how to use The Secret in every aspect of your life -- money Fragments of a Great Secret have been found in the oral traditions, in literature, in religions and philosophies throughout the centuries. For the first time, all the pieces of The Secret come together in an incredible revelation that will be life-transforming for all who experience it. In this book, you'll learn how to use The Secret in every aspect of your life -- money, health, relationships, happiness, and in every interaction you have in the world. You'll begin to understand the hidden, untapped power that's within you, and this revelation can bring joy to every aspect of your life. The Secret contains wisdom from modern-day teachers -- men and women who have used it to achieve health, wealth, and happiness. By applying the knowledge of The Secret, they bring to light compelling stories of eradicating disease, acquiring massive wealth, overcoming obstacles, and achieving what many would regard as impossible. ...more"},
{"title": "The Girl on the Train", "product_description": "The debut psychological thriller that will forever change the way you look at other people's lives.EVERY DAY THE SAMERachel takes the same commuter train every morning and night. Every day she rattles down the track, flashes past a stretch of cozy suburban homes, and stops at the signal that allows her to daily watch the same couple breakfasting on their deck. She’s even s The debut psychological thriller that will forever change the way you look at other people's lives.EVERY DAY THE SAMERachel takes the same commuter train every morning and night. Every day she rattles down the track, flashes past a stretch of cozy suburban homes, and stops at the signal that allows her to daily watch the same couple breakfasting on their deck. She’s even started to feel like she knows them. Jess and Jason, she calls them. Their life—as she sees it—is perfect. Not unlike the life she recently lost.UNTIL TODAYAnd then she sees something shocking. It’s only a minute until the train moves on, but it’s enough. Now everything’s changed. Unable to keep it to herself, Rachel goes to the police. But is she really as unreliable as they say? Soon she is deeply entangled not only in the investigation but in the lives of everyone involved. Has she done more harm than good? ...more"},
{"title": "The Psychopath Test: A Journey Through the Madness Industry", "product_description": "They say one out of every hundred people is a psychopath. You probably passed one on the street today. These are people who have no empathy, who are manipulative, deceitful, charming, seductive, and delusional. The Psychopath Test is the New York Times bestselling exploration of their world and the madness industry.When Jon Ronson is drawn into an elaborate hoax played on They say one out of every hundred people is a psychopath. You probably passed one on the street today. These are people who have no empathy, who are manipulative, deceitful, charming, seductive, and delusional. The Psychopath Test is the New York Times bestselling exploration of their world and the madness industry.When Jon Ronson is drawn into an elaborate hoax played on some of the world’s top scientists, his investigation leads him, unexpectedly, to psychopaths. He meets an influential psychologist who is convinced that many important business leaders and politicians are in fact high-flying, high-functioning psychopaths, and teaches Ronson how to spot them. Armed with these new abilities, Ronson meets a patient inside an asylum for the criminally insane who insists that he’s sane, a mere run-of-the-mill troubled youth, not a psychopath—a claim that might be only manipulation, and a sign of his psychopathy. He spends time with a death-squad leader institutionalized for mortgage fraud, and with a legendary CEO who took joy in shutting down factories and firing people. He delves into the fascinating history of psychopathy diagnosis and treatments, from LSD-fueled days-long naked therapy sessions in prisons to attempts to understand serial killers.Along the way, Ronson discovers that relatively ordinary people are, more and more, defined by their most insane edges. The Psychopath Test is a fascinating adventure through the minds of madness. ...more"},
{"title": "The Kite Runner", "product_description": "Khaled Hosseini's #1 New York Times Bestselling Debut “It may be unfair, but what happens in a few days, sometimes even a single day, can change the course of a whole lifetime. Amir is the son of a wealthy Kabul merchant, a member of the ruling caste of Pashtuns. Hassan, his servant and constant companion, is a Hazara, a despised and impoverished caste. Their uncommon bon Khaled Hosseini's #1 New York Times Bestselling Debut “It may be unfair, but what happens in a few days, sometimes even a single day, can change the course of a whole lifetime. Amir is the son of a wealthy Kabul merchant, a member of the ruling caste of Pashtuns. Hassan, his servant and constant companion, is a Hazara, a despised and impoverished caste. Their uncommon bond is torn by Amir's choice to abandon his friend amidst the increasing ethnic, religious, and political tensions of the dying years of the Afghan monarchy, wrenching them far apart. But so strong is the bond between the two boys that Amir journeys back to a distant world, to try to right past wrongs against the only true friend he ever had.The unforgettable, heartbreaking story of the unlikely friendship between a wealthy boy and the son of his father’s servant, The Kite Runner is a beautifully crafted novel set in a country that is in the process of being destroyed. It is about the power of reading, the price of betrayal, and the possibility of redemption; and an exploration of the power of fathers over sons—their love, their sacrifices, their lies.A sweeping story of family, love, and friendship told against the devastating backdrop of the history of Afghanistan over the last thirty years, The Kite Runner is an unusual and powerful novel that has become a beloved, one-of-a-kind classic. ...more"},
{"title": "Thirteen Reasons Why", "product_description": "Clay Jensen returns home from school to find a mysterious box with his name on it lying on his porch. Inside he discovers thirteen cassette tapes recorded by Hannah Baker, his classmate and crush who committed suicide two weeks earlier. On tape, Hannah explains that there are thirteen reasons why she decided to end her life. Clay is one of them. If he listens, he'll find o Clay Jensen returns home from school to find a mysterious box with his name on it lying on his porch. Inside he discovers thirteen cassette tapes recorded by Hannah Baker, his classmate and crush who committed suicide two weeks earlier. On tape, Hannah explains that there are thirteen reasons why she decided to end her life. Clay is one of them. If he listens, he'll find out how he made the list. Through Hannah and Clay's dual narratives, debut author Jay Asher weaves an intricate and heartrending story of confusion and desperation that will deeply affect teen readers. ...more"},
{"title": "A World of Flavor: Your Gluten Free Passport", "product_description": "Trade Review:A World of Flavor, Recipes to Please All of Your GuestsThe new gluten-free cookbook A World of Flavor is clearly a labor of love for its authors, Amber Barrett and Nancy Miller. Amber is also a gifted photographer, and the photographs in this book could be the best of any cookbook I've ever seen.On top of this, the book includes some amazing recipes that eve Trade Review:A World of Flavor, Recipes to Please All of Your GuestsThe new gluten-free cookbook A World of Flavor is clearly a labor of love for its authors, Amber Barrett and Nancy Miller. Amber is also a gifted photographer, and the photographs in this book could be the best of any cookbook I've ever seen.On top of this, the book includes some amazing recipes that everyone will like, including: Hot Wings, Bacon and Cheddar Scones, Donuts, Sandwich Bread, Rocky Road Brownies, Crepes, General Tso's Chicken, Croutons, and many more (I counted 77).From breakfasts, appetizers, desserts, main dishes and snacks, to salads, vegetables, and side dishes, this outstanding gluten-free cookbook has much to offer anyone who is on a gluten-free diet.Written by celiac.com April 2016.Mongolian Beef, Cuban Pork, Baked Alaska, French Crepes—if international cuisine gets your taste buds dancing, this the cookbook for you!Travel the world gluten free with mother and daughter authors Nancy Miller and Amber Barrett and their new cookbook, A World of Flavor: Your Gluten-Free Passport.This cookbook provides readers with an inspired combination of dishes from around the globe that are deliciously high in flavor with none of the gluten. These recipes do not rely on pricey cup-for-cup flour alternatives, but use a variety of flours tailored to the success of each individual recipe so you get results to be proud of. ...more"},
{"title": "Bossypants", "product_description": "Before Liz Lemon, before Weekend Update, before Sarah Palin, Tina Fey was just a young girl with a dream: a recurring stress dream that she was being chased through a local airport by her middle-school gym teacher. She also had a dream that one day she would be a comedian on TV.She has seen both these dreams come true.At last, Tina Fey's story can be told. From her you Before Liz Lemon, before Weekend Update, before Sarah Palin, Tina Fey was just a young girl with a dream: a recurring stress dream that she was being chased through a local airport by her middle-school gym teacher. She also had a dream that one day she would be a comedian on TV.She has seen both these dreams come true.At last, Tina Fey's story can be told. From her youthful days as a vicious nerd to her tour of duty on Saturday Night Live; from her passionately halfhearted pursuit of physical beauty to her life as a mother eating things off the floor; from her one-sided college romance to her nearly fatal honeymoon—from the beginning of this paragraph to this final sentence.Tina Fey reveals all, and proves what we've all suspected: you're no one until someone calls you bossy.(Includes Special, Never-Before-Solicited Opinions on Breastfeeding, Princesses, Photoshop, the Electoral Process, and Italian Rum Cake!)An unabridged recording on 5 CDs (5.5 Hours). ...more"},
{"title": "Soul Reader", "product_description": "Along with magic realism and a plethora of literary references throughout issues such as free will and identity flood the pages. What if your destiny was decided for you? What if you were meant for more?"},
{"title": "The Inefficiency Assassin: Time Management Tactics for Working Smarter, Not Longer", "product_description": "Slay Procrastination, Distraction, and Overwhelm!Who doesn’t want more time and energy for family, friends, and personal passions? Author Helene Segura coaches real people in the real world to operate more efficiently during the workday, so they can have a life outside it. Her engaging time management program caters to diverse learning styles, offering case studies that al Slay Procrastination, Distraction, and Overwhelm!Who doesn’t want more time and energy for family, friends, and personal passions? Author Helene Segura coaches real people in the real world to operate more efficiently during the workday, so they can have a life outside it. Her engaging time management program caters to diverse learning styles, offering case studies that allow readers to self-diagnose and zero in on the strategies most appropriate for them. Anyone wanting to streamline workflow and improve productivity can employ her wonderfully doable techniques — for clearing task lists, handling reminder systems, scheduling a variety of priorities, and even managing emails and phone calls. Thanks to Segura’s astute attention to personality, The Inefficiency Assassin meets readers where they are struggling and details quick and easy-to-implement strategies to, as Segura promises, “kick chaos to the curb.” ...more"},
{"title": "Maude (1883-1993):She Grew Up with the country", "product_description": "This new edition of Maude (1883-1993) has been updated by Mardo Williams’ daughters, adding historical details their dad wished to make, twice as many photos, and nine appendices not present in the 1996 hardcover (which won an Ohioana Library Award for its author). During her 110-year lifetime, Maude went from a 400-lb. wood-burning stove to a microwave oven, from an outdo This new edition of Maude (1883-1993) has been updated by Mardo Williams’ daughters, adding historical details their dad wished to make, twice as many photos, and nine appendices not present in the 1996 hardcover (which won an Ohioana Library Award for its author). During her 110-year lifetime, Maude went from a 400-lb. wood-burning stove to a microwave oven, from an outdoor privy to indoor plumbing. She got the vote in 1920 and voted in the next 18 Presidential elections.With poetry and human dramas (two murders and a suicide), written by a master journalist, the book shows the impact of the changing times on shy, unassuming Maude, her fun-loving husband Lee, and their four active children. They farmed 100 acres on the banks of Rush Creek in Logan County (Ohio).A favorite with book discussion groups, Maude has been adopted by several colleges for use as a supplemental American history text. ...more"},
{"title": "Penny Maybe", "product_description": "Sent to yet another foster family, Penny decides that the way to claim a sense of self is to swim Lake Ontario. Although this seems impossible, she finds the courage to ask her physics teacher to be her coach, and wins the support of her new foster mother."},
{"title": "Aladdin and His Wonderful Lamp", "product_description": "Planning on seeing Aladdin the Disney musical? Read the classic story of Aladdin and his Wonderful Lamp in this sparkling new edition by Harpendore. Synopsis: Aladdin is a poor boy who lives with his mother in the ancient kingdom of Cathay. One day a strange man appears offering untold riches! Aladdin is not so sure, yet he's sorely tempted. Join Aladdin on his incredib Planning on seeing Aladdin the Disney musical? Read the classic story of Aladdin and his Wonderful Lamp in this sparkling new edition by Harpendore. Synopsis: Aladdin is a poor boy who lives with his mother in the ancient kingdom of Cathay. One day a strange man appears offering untold riches! Aladdin is not so sure, yet he's sorely tempted. Join Aladdin on his incredible adventures and visit the cave of treasures. A world of magic awaits you, but watch your step - there's mischief lurking at every turn! The Arabian Nights (also known as The One Thousand and One Nights) is an ancient collection of tales that have existed for thousands of years. Harpendore's Arabian Nights Adventures are beautifully retold versions of these ancient classics that are specially designed to appeal to children aged seven years and above. They are written in a warm and accessible style and include wonderful illustrations inside. With mischief and magic in equal measure, this series is sure to captivate readers everywhere. The Arabian Nights Adventures series is being released throughout 2016 and 2017. Stories to be included are: The Adventures of Prince Camar & Princess Badoura Aladdin and his Wonderful Lamp Gulnare of the Sea Ali Baba and the Forty Thieves The Seven Voyages of Sinbad the Sailor The Enchanted Horse The Talking Bird, the Singing Tree and the Golden Water The Merchant and the Genie The Tale of Zubaidah and the Three Qalandars The Adventures of Harun al-Rashid, Caliph of Baghdad The Three Princes, the Princess and the Jinni Pari Banou The Fisherman and the Genie The King's Jester (also known as The Little Hunchback) ...more"},
{"title": "The Songs of the Gods", "product_description": "The Power of Dream It has been ages since the last time you enjoyed the night more than what you enjoy your overcoat. Then you would dance the night, now you wear the night, It is an accessory to hide you from everyone. The Songs of the Gods is a collection of poems reaching deep into the human soul. Love, hate, search, longing and reality are carefully tested and presen The Power of Dream It has been ages since the last time you enjoyed the night more than what you enjoy your overcoat. Then you would dance the night, now you wear the night, It is an accessory to hide you from everyone. The Songs of the Gods is a collection of poems reaching deep into the human soul. Love, hate, search, longing and reality are carefully tested and presented; from the subtle dreams of being in love to the cruelty of the inescapable reality. The power of the writing resembles the magnitude of poets like Arthur Rimbaud and William Blake. ...more"},
{"title": "The Wright Brothers", "product_description": "Two-time winner of the Pulitzer Prize David McCullough tells the dramatic story-behind-the-story about the courageous brothers who taught the world how to fly: Wilbur and Orville Wright.On a winter day in 1903, in the Outer Banks of North Carolina, two unknown brothers from Ohio changed history. But it would take the world some time to believe what had happened: the age of Two-time winner of the Pulitzer Prize David McCullough tells the dramatic story-behind-the-story about the courageous brothers who taught the world how to fly: Wilbur and Orville Wright.On a winter day in 1903, in the Outer Banks of North Carolina, two unknown brothers from Ohio changed history. But it would take the world some time to believe what had happened: the age of flight had begun, with the first heavier-than-air, powered machine carrying a pilot.Who were these men and how was it that they achieved what they did?David McCullough, two-time winner of the Pulitzer Prize, tells the surprising, profoundly American story of Wilbur and Orville Wright.Far more than a couple of unschooled Dayton bicycle mechanics who happened to hit on success, they were men of exceptional courage and determination, and of far-ranging intellectual interests and ceaseless curiosity, much of which they attributed to their upbringing. The house they lived in had no electricity or indoor plumbing, but there were books aplenty, supplied mainly by their preacher father, and they never stopped reading.When they worked together, no problem seemed to be insurmountable. Wilbur was unquestionably a genius. Orville had such mechanical ingenuity as few had ever seen. That they had no more than a public high school education, little money and no contacts in high places, never stopped them in their mission to take to the air. Nothing did, not even the self-evident reality that every time they took off in one of their contrivances, they risked being killed.In this thrilling book, master historian David McCullough draws on the immense riches of the Wright Papers, including private diaries, notebooks, scrapbooks, and more than a thousand letters from private family correspondence to tell the human side of the Wright Brothers' story, including the little-known contributions of their sister, Katharine, without whom things might well have gone differently for them. ...more"},
{"title": "V for Vendetta (V for Vendetta Complete)", "product_description": "Remember, remember the fifth of November...A frightening and powerful tale of the loss of freedom and identity in a chillingly believable totalitarian world, V for Vendetta stands as one of the highest achievements of the comics medium and a defining work for creators Alan Moore and David Lloyd.Set in an imagined future England that has given itself over to fascism, this Remember, remember the fifth of November...A frightening and powerful tale of the loss of freedom and identity in a chillingly believable totalitarian world, V for Vendetta stands as one of the highest achievements of the comics medium and a defining work for creators Alan Moore and David Lloyd.Set in an imagined future England that has given itself over to fascism, this groundbreaking story captures both the suffocating nature of life in an authoritarian police state and the redemptive power of the human spirit which rebels against it. Crafted with sterling clarity and intelligence, V for Vendetta brings an unequaled depth of characterization and verisimilitude to its unflinching account of oppression and resistance. ...more"},
{"title": "Unbroken: A World War II Story of Survival, Resilience, and Redemption", "product_description": "On a May afternoon in 1943, an Army Air Forces bomber crashed into the Pacific Ocean and disappeared, leaving only a spray of debris and a slick of oil, gasoline, and blood. Then, on the ocean surface, a face appeared. It was that of a young lieutenant, the plane’s bombardier, who was struggling to a life raft and pulling himself aboard. So began one of the most extraordin On a May afternoon in 1943, an Army Air Forces bomber crashed into the Pacific Ocean and disappeared, leaving only a spray of debris and a slick of oil, gasoline, and blood. Then, on the ocean surface, a face appeared. It was that of a young lieutenant, the plane’s bombardier, who was struggling to a life raft and pulling himself aboard. So began one of the most extraordinary odysseys of the Second World War.The lieutenant’s name was Louis Zamperini. In boyhood, he’d been a cunning and incorrigible delinquent, breaking into houses, brawling, and fleeing his home to ride the rails. As a teenager, he had channeled his defiance into running, discovering a prodigious talent that had carried him to the Berlin Olympics and within sight of the four-minute mile. But when war had come, the athlete had become an airman, embarking on a journey that led to his doomed flight, a tiny raft, and a drift into the unknown.Ahead of Zamperini lay thousands of miles of open ocean, leaping sharks, a foundering raft, thirst and starvation, enemy aircraft, and, beyond, a trial even greater. Driven to the limits of endurance, Zamperini would answer desperation with ingenuity; suffering with hope, resolve, and humor; brutality with rebellion. His fate, whether triumph or tragedy, would be suspended on the fraying wire of his will.In her long-awaited new book, Laura Hillenbrand writes with the same rich and vivid narrative voice she displayed in Seabiscuit. Telling an unforgettable story of a man’s journey into extremity, Unbroken is a testament to the resilience of the human mind, body, and spirit. ...more"},
{"title": "Amatus", "product_description": "Crispian, who has lived in a city of darkness all his life, must make a choice: remain safe in his home, but forever wonder what the mysterious light on the horizon could be--or trust a young woman to guide him to a wonderful realm he's never seen, and risk being deceived and led to a terrible death."},
{"title": "Anonymous", "product_description": "Logan Matthews is a father, architect, and widower. He lives in Brooklyn, New York with his three year old son, Liam. His life is as ordinary as any single father with a toddler. Lara Miller is a single mother raising her nine year old daughter, Olivia in New York City, the city that never sleeps. She lives with her roommate, Erin and finds that she enjoys life just the wa Logan Matthews is a father, architect, and widower. He lives in Brooklyn, New York with his three year old son, Liam. His life is as ordinary as any single father with a toddler. Lara Miller is a single mother raising her nine year old daughter, Olivia in New York City, the city that never sleeps. She lives with her roommate, Erin and finds that she enjoys life just the way it is. Logan and Lara have all but given up on love. However, fate has another plan for these parents because they both share something that will draw them together in a way they never thought possible. Their daughter. ...more"},
{"title": "Amy Meets the Saints and Sages", "product_description": "All major religions have saints and sages that are pinnacles of love and integrity. Wouldn't your child benefit from having them as role models? Wouldn't it empower your child to know that these saints/sages are real people, some of whom are living right now?In Amy Meets the Saints and Sages, A Young Person's Adventures in Spirituality your child gets to meet six saints/ All major religions have saints and sages that are pinnacles of love and integrity. Wouldn't your child benefit from having them as role models? Wouldn't it empower your child to know that these saints/sages are real people, some of whom are living right now?In Amy Meets the Saints and Sages, A Young Person's Adventures in Spirituality your child gets to meet six saints/sages from six different traditions: Islam, Catholicism, Judaism, Native American, Tibetan Buddhism, and Hinduism. Three of the saints/sages are women; three are men. Three are still with us; three have passed on. Your child is introduced to these saints/sages first through a brief but reverent biography. Then second, your child gets to know the saint/sage better through a concrete story. Children love stories and they have a way of sticking to a child for years. And finally, let's make it personal by having the saint/sage and a young person, about your child's age, fictionally interact around the story. It's all fun and engaging for both child and adults.It's for children age 7-12 and is fully illustrated. There is never any attempt to have your child join anything.And, as your child comes to appreciate various religions, a bit more religious tolerance is gained. With that gain a bit more peace has come forth.Find out more at http://www.mychildsprayers.com/amy-me... ...more"},
{"title": "Beauty Restored (Riley Family Legacy Novellas #3)", "product_description": "While volunteering at a youth camp in the Ozark Mountains, Carmen Riley sponsors a challenging group of teenage girls. She longs to make a difference in their lives, but unsettling news from home rattles her confidence. When Carmen meets a charming young pastor, will his wise advice give her the courage she desperately needs? After discovering that the camp is in danger of While volunteering at a youth camp in the Ozark Mountains, Carmen Riley sponsors a challenging group of teenage girls. She longs to make a difference in their lives, but unsettling news from home rattles her confidence. When Carmen meets a charming young pastor, will his wise advice give her the courage she desperately needs? After discovering that the camp is in danger of closing, Pastor Andrew vows to save it. With Carmen's help, he rallies a group of sponsors to come up with a plan of action. However, the task could cost him much more than he bargains for. In a race against time, a common goal unites them, but unforeseen circumstances threaten to tear them apart. Will their relationship and faith in God endure long enough to see Beauty Restored? ...more"},
{"title": "Ayumi's Violin", "product_description": "In 1959 when her mother dies, twelve-year-old Ayumi leaves her home in Japan to find her American father. Biracial, she is confronted with a resentful half-sister and a racist stepmother. She wants to be accepted by her new family, but how much of her true self must she give up? Ayumi’s only solace is her music. When she is deprived of her violin, she shocks even herself b In 1959 when her mother dies, twelve-year-old Ayumi leaves her home in Japan to find her American father. Biracial, she is confronted with a resentful half-sister and a racist stepmother. She wants to be accepted by her new family, but how much of her true self must she give up? Ayumi’s only solace is her music. When she is deprived of her violin, she shocks even herself by doing the unthinkable. ...more"},
{"title": "Done Rubbed Out (Reightman & Bailey #1)", "product_description": "In this first book of the Reightman & Bailey Series, deceit, corruption and murder tangle together with vivid, unconventional characters in a story of unlikely friendships and their power to change us. Things are going well at the Time Out Spa, but the night young proprietor Toby Bailey discovers his former lover naked and dead on a massage table, more things are spoil In this first book of the Reightman & Bailey Series, deceit, corruption and murder tangle together with vivid, unconventional characters in a story of unlikely friendships and their power to change us. Things are going well at the Time Out Spa, but the night young proprietor Toby Bailey discovers his former lover naked and dead on a massage table, more things are spoiled than just his white leather shoes. Detective Melba Reightman and partner, Sam Jackson are called in to investigate and soon become embroiled in the most perplexing homicide case seen in years.After a hunting knife engraved with Toby's name is found in a load of wet, bloody laundry, he's arrested for the murder of Geraldo Guzman. He enlists the help of Madame Zhou Li, practicing attorney and owner of Green Dragon Chinese Herbs and Teas. The peculiar octogenarian seems an unlikely choice to defend him, but has a few tricks up her sleeve. Toby joins forces with Reightman and Jackson, and a shocking string of clues leads them closer to the killer. The bad news? Successfully solving the crime might unleash a firestorm on this southern city and come at a price none of them are prepared to pay. ...more"},
{"title": "First Steps for New Christians (Print Edition)", "product_description": "Our enemy, the devil, prowls around like a lion. (1 Peter 5:8) All he wants to do is steal, kill and destroy (John 10:10). And much like the pattern we find in the wild, the ancient serpent will stalk the youngest of the flock because they’re the easiest target. So I’m writing these short readings to encourage new Christians during the most vulnerable part of their journey Our enemy, the devil, prowls around like a lion. (1 Peter 5:8) All he wants to do is steal, kill and destroy (John 10:10). And much like the pattern we find in the wild, the ancient serpent will stalk the youngest of the flock because they’re the easiest target. So I’m writing these short readings to encourage new Christians during the most vulnerable part of their journey.I want to remind new followers of the “Way” that the Christian life is best lived in community with others who are striving to follow Jesus. One of our first responsibilities as a new Christian is to spend as much time as possible with others who are being real with their faith. Just as a soldier would never go into battle alone and unarmed, we must remember that though our struggle is not against flesh and blood (Ephesians 6:12), it’s still a battle. It’s important to make sure we have other soldiers around us and we are armed with the Sword of the Spirit. (Ephesians 6:17 & Hebrews 4:12)One thing that the enemy will try to do is make you doubt your salvation. The last thing he needs is one more person confident in their relationship with Jesus Christ. As you read through these short devotions hold on to this truth: Salvation was yours the moment you acknowledged your need for a Savior (Romans 3:10-12), repented of your sins (Acts 3:19) and confessed Jesus Christ as your Lord. (Romans 10:9-10) Hopefully, you’ll find other truths to hang on to as you move through the pages of this book.So hold on to what you have (Revelation 3:11), hang tight with your “platoon” (Hebrews 10:24-25) and use the Sword (Hebrews 4:12 & Ephesians 6:17) you’ll find in the following pages for your weapon as the words that accompany the Scripture give you encouragement to stay the course. ...more"},
{"title": "Grumbles", "product_description": "Grumbles is a little Nid that goes on her first day to school and has to answer the question of what she wants to be when she grows up. First Time Reader BookWritten and Illustrated by Sondra Faye"},
{"title": "Large Print Heart of the Pride", "product_description": "Paranormal Romance Erotic Werelion Thrill Ride. Book 1 of the Fur, Lust & Magic series.Alexis is finally getting to go to school, to study music. Since her Mom died in a suspicious car crash, her Dad has filled her life with a swinging door of bodyguards and kept her home. After gaining weight and having no freedom she feels like the only 24 year old that has never had Paranormal Romance Erotic Werelion Thrill Ride. Book 1 of the Fur, Lust & Magic series.Alexis is finally getting to go to school, to study music. Since her Mom died in a suspicious car crash, her Dad has filled her life with a swinging door of bodyguards and kept her home. After gaining weight and having no freedom she feels like the only 24 year old that has never had a boyfriend in America.Her new bodyguard Derek turns out to be more than muscle. She falls for him hard and even more shocking he falls for her! Of course, she has no idea Derek and his muscle bound friends are all Werecats. If they ever find any time alone with a crazy stalker after her, mutant freaks, crazy Werewolves and of course her Dad showing up whenever they are alone she will find out soon enough, because when the clothes come off the fur grows. ...more"},
{"title": "Drive: The Surprising Truth About What Motivates Us", "product_description": "Forget everything you thought you knew about how to motivate people—at work, at school, at home. It's wrong. As Daniel H. Pink (author of To Sell Is Human: The Surprising Truth About Motivating Others) explains in his paradigm-shattering book Drive, the secret to high performance and satisfaction in today's world is the deeply human need to direct our own lives, to learn a Forget everything you thought you knew about how to motivate people—at work, at school, at home. It's wrong. As Daniel H. Pink (author of To Sell Is Human: The Surprising Truth About Motivating Others) explains in his paradigm-shattering book Drive, the secret to high performance and satisfaction in today's world is the deeply human need to direct our own lives, to learn and create new things, and to do better by ourselves and our world.Drawing on four decades of scientific research on human motivation, Pink exposes the mismatch between what science knows and what business does—and how that affects every aspect of our lives. He demonstrates that while the old-fashioned carrot-and-stick approach worked successfully in the 20th century, it's precisely the wrong way to motivate people for today's challenges. In Drive, he reveals the three elements of true motivation:*Autonomy—the desire to direct our own lives*Mastery—the urge to get better and better at something that matters*Purpose—the yearning to do what we do in the service of something larger than ourselvesAlong the way, he takes us to companies that are enlisting new approaches to motivation and introduces us to the scientists and entrepreneurs who are pointing a bold way forward.Drive is bursting with big ideas—the rare book that will change how you think and transform how you live. ...more"},
{"title": "Eureka Trivia 6.0", "product_description": "Eureka Trivia 6.0 is a great trivia book for all Eureka fans. With over 300 questions, this trivia book is designed so you can play single games, group games, or just read at your leisure. It was vital for us as fans to provide this book with only the best of questions so you can relive each moment. We have included answer sheets, cutouts, and all references to the questio Eureka Trivia 6.0 is a great trivia book for all Eureka fans. With over 300 questions, this trivia book is designed so you can play single games, group games, or just read at your leisure. It was vital for us as fans to provide this book with only the best of questions so you can relive each moment. We have included answer sheets, cutouts, and all references to the questions. We want you to know exactly where we found them. Whether you play on your own; play in group play, or just read through for your enjoyment, we hope you have a Eureka fun time! Game Play: • A Stand-Alone Read • Single & Group Play • Level Chart (which cast(s) level are you on?) • Over 280 multiple choice questions • Complete reference answers guide • Answer sheets cutouts Rewards: • Earn an internship at Global Dynamics • Gain access to Section 1-4 • Become an assistant to a top scientist • Get your own lab at Global Dynamics • Become Head of Global Dynamics • Oh, and, you could also get Redacted UnControlled Pen is not associated with the series creators, writers or cast. ...more"},
{"title": "Poses for Artists Volume 1 - Dynamic and Sitting Poses: An Essential Reference for Figure Drawing and the Human Form", "product_description": "This book was created by an artist who understands that sometimes, you just need a creative nudge to help get the pencil moving and break that pesky block. By simplifying the human form, we hope to remove the inevitable anxiety that comes with drawing a person, and speed-up your art, over time, increasing your own understanding of human anatomy, proportions and movement."},
{"title": "Miss Peregrine’s Home for Peculiar Children (Miss Peregrine’s Peculiar Children #1)", "product_description": "A mysterious island. An abandoned orphanage. A strange collection of curious photographs.A horrific family tragedy sets sixteen-year-old Jacob journeying to a remote island off the coast of Wales, where he discovers the crumbling ruins of Miss Peregrine’s Home for Peculiar Children. As Jacob explores its abandoned bedrooms and hallways, it becomes clear that the children w A mysterious island. An abandoned orphanage. A strange collection of curious photographs.A horrific family tragedy sets sixteen-year-old Jacob journeying to a remote island off the coast of Wales, where he discovers the crumbling ruins of Miss Peregrine’s Home for Peculiar Children. As Jacob explores its abandoned bedrooms and hallways, it becomes clear that the children were more than just peculiar. They may have been dangerous. They may have been quarantined on a deserted island for good reason. And somehow—impossible though it seems—they may still be alive.A spine-tingling fantasy illustrated with haunting vintage photography, Miss Peregrine's Home for Peculiar Children will delight adults, teens, and anyone who relishes an adventure in the shadows.~ ...more"},
{"title": "Secrets and Lace (Fatal Hearts #1)", "product_description": "**WARNING: Due to sexual situations and adult content, this dark romance thriller series is not intended for readers under the age of 18, and anyone who is unable to read books containing, kidnapping, murder, rape, and extreme abuse. ** Chloe Parker has the world at her feet. Her career in magazine publishing is flourishing, and she’s about to be married to Miles Durant, a **WARNING: Due to sexual situations and adult content, this dark romance thriller series is not intended for readers under the age of 18, and anyone who is unable to read books containing, kidnapping, murder, rape, and extreme abuse. ** Chloe Parker has the world at her feet. Her career in magazine publishing is flourishing, and she’s about to be married to Miles Durant, a gorgeous billionaire, and the man of her dreams. But one month before her wedding, she receives a countdown card. No sender. No return address. No message. Only a piece of lace stained with blood. As the wedding gets closer the cards keep coming to her every day without fail. It seems, while she’s counting down to the happiest day of her life, someone is doing a countdown of their own. Chloe fears she’s in danger, but she can’t turn to the cops for help. There’s something in her past she wants to remain hidden, a dark secret that could destroy the life of her dreams. To make things worse, Miles is becoming increasingly impatient and suspicious about her past, to the point where he’s so angry he becomes a man she doesn’t recognize. While working to keep her relationship intact, Chloe must find out who wants to hurt her before she loses everything, or ends up dead. ...more"},
{"title": "Romero and Juliet: A Tragic Tale of Love and Zombies", "product_description": "You all know the tale. Star-crossed lovers meet; all they want is what they cannot have. Each other. It's a story as old as time - or is it? The headstrong Romero of the house of Montague holds nothing but contempt for the cowardly DeCapulets. Until, that is, he meets Juliet. Beautiful; deadly; her skill with a bow is matched by no other, and she fires an arrow straight th You all know the tale. Star-crossed lovers meet; all they want is what they cannot have. Each other. It's a story as old as time - or is it? The headstrong Romero of the house of Montague holds nothing but contempt for the cowardly DeCapulets. Until, that is, he meets Juliet. Beautiful; deadly; her skill with a bow is matched by no other, and she fires an arrow straight through young Romero's heart. Torn between their warring families and trapped by the waves of the undead crashing against the city walls, what chance do our young couple stand at having a future together? You thought you knew the story of Romeo and Juliet? Think again in this satirical retelling of one of the world's most well-known love stories. Containing love, gore, and sarcasm, it's a story suitable for teens upwards, and should be enjoyed by adults 'of all ages' ...more"},
{"title": "America's Cradle of Quarterbacks: Western Pennsylvania's Football Factory from Johnny Unitas to Joe Montana", "product_description": "Any fan of the Baltimore Colts of my era, any fan of my friend and teammate Johnny Unitas, or, for that matter, any fan of football in general should enjoy Wayne Stewart's book. It contains great stories, statistics, and information on all of the many great quarterbacks whocame out of Western Pennsylvania and much more. Raymond Berry NFL Hall of Fame Wide Receiver It’s wel Any fan of the Baltimore Colts of my era, any fan of my friend and teammate Johnny Unitas, or, for that matter, any fan of football in general should enjoy Wayne Stewart's book. It contains great stories, statistics, and information on all of the many great quarterbacks whocame out of Western Pennsylvania and much more. Raymond Berry NFL Hall of Fame Wide Receiver It’s well known that the NFL has been dominated through the years by quarterbacks sown and grown in a relatively small area surrounding the city of Pittsburgh in Western Pennsylvania. In America’s Cradle of Quarterbacks, author Wayne Stewart not only tells us who they are, he digs deep to explain the nature and nurture behind the rich harvest of signal callers (Montana, Unitas, Marino, Namath, Kelly, Blanda, etc.) who have risen from that fertile soil to claim Lombardi Trophies and dominate the gallery of busts in the Pro Football Hall of Fame. Stewart has written a fascinating book that belongs on the shelves of football historians and everyday fans alike. Jeffrey J. Miller Author of Rockin’ The Rockpile, Buffalo’sForgotten Champions, and Game Changers ...more"},
{"title": "Starving Hearts (Triangular Trade Trilogy, #1)", "product_description": "Since her assault, Miss Annette Chetwynd has been plagued by nightmares and worries about an arranged marriage. But she yearns to find her anonymous rescuer. Unfortunately, her health and intellect prevent it. Both repel suitors and cause Annette to doubt God's existence, at least until He answers her prayers in an unusual way ... Mr. Peter Adsley is joining the clergy, an Since her assault, Miss Annette Chetwynd has been plagued by nightmares and worries about an arranged marriage. But she yearns to find her anonymous rescuer. Unfortunately, her health and intellect prevent it. Both repel suitors and cause Annette to doubt God's existence, at least until He answers her prayers in an unusual way ... Mr. Peter Adsley is joining the clergy, and he desires a godly wife by his side. After his failed attempt to obtain one, he engages in a clandestine meeting with the bewitching young woman who keeps crossing his path. But she is so unsettling. Destined for disappointments, Peter and Annette endure disgraceful situations. Will Peter's faith sustain him through overwhelming setbacks? Can Annette overcome her doubts? Or will their starving hearts yield to the machinations of a mad man? ...more"},
{"title": "The Boys in the Boat: Nine Americans and Their Epic Quest for Gold at the 1936 Berlin Olympics", "product_description": "For readers of Laura Hillenbrand's Seabiscuit and Unbroken, the dramatic story of the American rowing team that stunned the world at Hitler's 1936 Berlin Olympics Daniel James Brown’s robust book tells the story of the University of Washington’s 1936 eight-oar crew and their epic quest for an Olympic gold medal, a team that transformed the sport and grabbed the attention o For readers of Laura Hillenbrand's Seabiscuit and Unbroken, the dramatic story of the American rowing team that stunned the world at Hitler's 1936 Berlin Olympics Daniel James Brown’s robust book tells the story of the University of Washington’s 1936 eight-oar crew and their epic quest for an Olympic gold medal, a team that transformed the sport and grabbed the attention of millions of Americans. The sons of loggers, shipyard workers, and farmers, the boys defeated elite rivals first from eastern and British universities and finally the German crew rowing for Adolf Hitler in the Olympic games in Berlin, 1936. The emotional heart of the story lies with one rower, Joe Rantz, a teenager without family or prospects, who rows not for glory, but to regain his shattered self-regard and to find a place he can call home. The crew is assembled  by an enigmatic coach and mentored by a visionary, eccentric British boat builder, but it is their trust in each other that makes them a victorious team. They remind the country of what can be done when everyone quite literally pulls together—a perfect melding of commitment, determination, and optimism. Drawing on the boys’ own diaries and journals, their photos and memories of a once-in-a-lifetime shared dream, The Boys in the Boat is an irresistible story about beating the odds and finding hope in the most desperate of times—the improbable, intimate story of nine working-class boys from the American west who, in the depths of the Great Depression, showed the world what true grit really meant. It will appeal to readers of Erik Larson, Timothy Egan, James Bradley, and David Halberstam's The Amateurs. ...more"},
{"title": "The Art of War", "product_description": "Conflict is an inevitable part of life, according to this ancient Chinese classic of strategy, but everything necessary to deal with conflict wisely, honorably, victoriously, is already present within us. Compiled more than two thousand years ago by a mysterious warrior-philosopher, The Art of War is still perhaps the most prestigious and influential book of strategy in t Conflict is an inevitable part of life, according to this ancient Chinese classic of strategy, but everything necessary to deal with conflict wisely, honorably, victoriously, is already present within us. Compiled more than two thousand years ago by a mysterious warrior-philosopher, The Art of War is still perhaps the most prestigious and influential book of strategy in the world, as eagerly studied in Asia by modern politicians and executives as it has been by military leaders since ancient times. As a study of the anatomy of organizations in conflict, The Art of War applies to competition and conflict in general, on every level from the interpersonal to the international. Its aim is invincibility, victory without battle, and unassailable strength through understanding the physics, politics, and psychology of conflict.(Original publication date was circa 500 BCE.)For an outstanding Kindle edition, please refer to The Art of War by Sun Tzu - Classic Collector's Edition (Shawn Conners, Barton Williams, Lionel Giles, Sian Kim) ...more"},
{"title": "The Coming Woman: A Novel Based on the Life of the Infamous Feminist, Victoria Woodhull", "product_description": "If you have a heart, if you have a soul, Karen Hicks' The Coming Woman will make you fall in love with Victoria Woodhull.-Kinky Friedman, author and Governor of the Heart of Texas What kind of confidence would it take for a woman to buck the old boy's club of politics in 1872? More than 140 years pre-Hillary, there was Victoria Woodhull. This book takes you back with a If you have a heart, if you have a soul, Karen Hicks' The Coming Woman will make you fall in love with Victoria Woodhull.-Kinky Friedman, author and Governor of the Heart of Texas What kind of confidence would it take for a woman to buck the old boy's club of politics in 1872? More than 140 years pre-Hillary, there was Victoria Woodhull. This book takes you back with a breathtaking, present-tense bird's eye view into a time when women's liberation was primarily confined to one woman's very capable, independent mind. I couldn't put it down.---Ruth Buzzi, Golden Globe Award winner and Television Hall of Fame inducteeSadly, too many Americans have never heard of Victoria Woodhull, let alone learned of her story: her revolutionary campaign for the presidency at a time when women weren't even allowed to vote, her support for worker's rights, or her feminist commitment to equality, a century before the official battle over the Equal Rights Amendment. But in The Coming Woman, Karen Hicks brings Woodhull's efforts to life, and reminds us that some of our nation's greatest figures aren't always featured in the history books. It is a riveting account of an amazing woman and her struggle for justice and human dignity, told in an engaging and eminently readable style.-Tim Wise, author, White Like Me: Reflections on Race from a Privileged SonThe Coming Woman is a novel based on the life of feminist Victoria Woodhull, the first woman to run for U.S. President, 50 years before women could even vote!Running for President wasn't Victoria's only first as a woman. She was also the first to own a successful Wall Street firm, the first to publish a successful national newspaper, and the first to head the two-million-member Spiritualist Association. She was the first woman to enter the Senate Judiciary Committee chambers to petition for woman's suffrage, her argument changing the entire focus of the suffragist movement by pointing out that the 14th and 15th Amendments already gave women the vote.In her campaign for the Presidency, Victoria Woodhull boldly addressed many of the issues we still face today: equal pay for equal work; freedom in love; corporate greed and political corruption fueled by powerful lobbyists; and the increasing disparity between the rich and the poor, to name only a few. Her outspoken and common-sense ideas may shed a new perspective on the parallel conundrums of today's world.This bold, beautiful, and sexually progressive woman dared to take on society and religion. To make an example of the hypocrisy in what Mark Twain dubbed The Gilded Age, she exposed the extramarital affairs of the most popular religious figure of the day (Henry Ward Beecher). This led to her persecution and imprisonment and the longest, most infamous trial of the 19th century. But it did not stop her fight for equality.Victoria's epic story, set in the late 1800s, comes to life in a modern, fictional style, while staying true to the actual words and views of the many well-known characters. ...more"},
{"title": "Raspberry Pi Electronics Projects for the Evil Genius", "product_description": "10 brand new DIY projects for your Raspberry Pi!This fully illustrated TAB guide shows how to construct and program all kinds of fun and innovative gadgets with your Raspberry Pi. Raspberry Pi Electronics Projects for the Evil Genius features 10 complete projects that showcase cool RasPi applications in computing, communications, robotics, photography, and video. Each in 10 brand new DIY projects for your Raspberry Pi!This fully illustrated TAB guide shows how to construct and program all kinds of fun and innovative gadgets with your Raspberry Pi. Raspberry Pi Electronics Projects for the Evil Genius features 10 complete projects that showcase cool RasPi applications in computing, communications, robotics, photography, and video. Each inexpensive Evil Genius project includes a detailed list of materials, sources for parts, schematics, and clear, step-by-step assembly and programming instructions. This entertaining, easy-to-follow book gets you up-and-running quickly on C, Java, and Python, and covers all RasPi versions, including the latest A+, B+, and B model 2 units.Learn how to: . Explore the capabilities and features of your Raspberry Pi. Display scrolling text and graphics on an RGB LED matrix screen. Handle RasPi-to-RasPi communications using MQTT. Incorporate interesting software defined radio (SDR) features. Build your own super computer from eight RasPi model B+s. Make a robotic car from Legos and control it with your RasPi. Configure the RasPi to control a basic robotic arm through the I2C bus. Assemble and program complex 3DOF and 6DOF robotic arms. Construct a hi-res point-and-shoot and a digital single lens reflex (DSLR) camera. Engineer a complete infrared video surveillance system using the Pi Noir camera ...more"},
{"title": "The Three Searches, Meaning, and the Story", "product_description": "Human societies have always been preoccupied with three main searches: the Search for Technology, the Search for Truth, and the Search for Meaning. Social structures; currents of action and thought; philosophies; and history, all are driven and honed by the Three Searches. And the most frequent and conscious of these searches is that for Meaning. The Story is indispensable Human societies have always been preoccupied with three main searches: the Search for Technology, the Search for Truth, and the Search for Meaning. Social structures; currents of action and thought; philosophies; and history, all are driven and honed by the Three Searches. And the most frequent and conscious of these searches is that for Meaning. The Story is indispensable for the Search for Meaning.In this second part of The Story in Three Parts, John H.T. Francis presents a philosophical essay on the central role of the Story in our lives and in our general understanding of the world. The Story is everywhere, in all that is of human meaning. It is in us and in our outside reality; it is even, in a certain sense, our outside reality in its unfolding.The Three Searches, Meaning, and the Story is a foundational essay in philosophy, which can be read independently from the other parts of The Story in Three Parts. ...more"},
{"title": "Angels & Demons (Robert Langdon #1)", "product_description": "When world-renowned Harvard symbologist Robert Langdon is summoned to a Swiss research facility to analyze a mysterious symbol—seared into the chest of a murdered physicist—he discovers evidence of the unimaginable: the resurgence of an ancient secret brotherhood known as the Illuminati ... the most powerful underground organization ever to walk the earth. The Illuminati h When world-renowned Harvard symbologist Robert Langdon is summoned to a Swiss research facility to analyze a mysterious symbol—seared into the chest of a murdered physicist—he discovers evidence of the unimaginable: the resurgence of an ancient secret brotherhood known as the Illuminati ... the most powerful underground organization ever to walk the earth. The Illuminati has now surfaced to carry out the final phase of its legendary vendetta against its most hated enemy—the Catholic Church. Langdon’s worst fears are confirmed on the eve of the holy conclave, when a messenger of the Illuminati announces they have hidden an unstoppable time bomb at the very heart of Vatican City. With the countdown under way, Langdon jets to Rome to join forces with Vittoria Vetra, a beautiful and mysterious Italian scientist, to assist the Vatican in a desperate bid for survival. Embarking on a frantic hunt through sealed crypts, dangerous catacombs, deserted cathedrals, and even the most secretive vault on earth, Langdon and Vetra follow a 400-year-old trail of ancient symbols that snakes across Rome toward the long-forgotten Illuminati lair ... a clandestine location that contains the only hope for Vatican salvation. ...more"},
{"title": "How to Speak Golf: An Illustrated Guide to Links Lingo", "product_description": "From ace to zinger, How to Speak Golf includes over 125 golf terms paired with charming and clever illustrations that decode the words and phrases that fly around a golf course. Clubhouse Chatter sections are sprinkled throughout where you'll learn about everything from the origins of golf, the worst courses and biggest sand bunkers in the world, to the reason why there ar From ace to zinger, How to Speak Golf includes over 125 golf terms paired with charming and clever illustrations that decode the words and phrases that fly around a golf course. Clubhouse Chatter sections are sprinkled throughout where you'll learn about everything from the origins of golf, the worst courses and biggest sand bunkers in the world, to the reason why there are so many bird references in golf terminology, a history of famous holes-in-one, and much, much more!Some of the terms included in the book are:-Army golf: The inconsistent hitting of the ball from one side of the fairway to the other. (Think: Left, right, left.)-Cabbage: The worst of the rough. (Also known as Spinach or Lettuce. Whatever you call it, this is a salad to be avoided.)-Ham and egg: When two players on a team pair well, with one player excelling whenever the other falters.-Velcro: Greens that are slow, where it seems like the ball sticks to the grass.A perfect blend of funny anecdotes and fascinating bits of history and trivia, this is the perfect gift book to have you talking like a master whether you're a pro, a lifelong fan, or a novice on the greens. ...more"},
{"title": "Carrie", "product_description": "Carrie knew she should not use the terrifying power she possessed... But one night at her senior prom, Carrie was scorned and humiliated just one time too many, and in a fit of uncontrollable fury she turned her clandestine game into a weapon of horror and destruction..."},
{"title": "Carry On, Warrior: Thoughts on Life Unarmed", "product_description": "An inspirational, sidesplittingly funny exploration of the power of living with love, forgiveness, and honesty.In Carry On, Warrior, Glennon Doyle Melton shares new stories and the best-loved material from Momastery.com She recounts her mistakes and triumphs with candor and humor, and gives language to our universal (yet often secret) experiences. She believes that by shed An inspirational, sidesplittingly funny exploration of the power of living with love, forgiveness, and honesty.In Carry On, Warrior, Glennon Doyle Melton shares new stories and the best-loved material from Momastery.com She recounts her mistakes and triumphs with candor and humor, and gives language to our universal (yet often secret) experiences. She believes that by shedding our armor, we can stop hiding, competing, striving for the mirage of perfection, and making motherhood, marriage, and friendship harder by pretending they’re not hard. In this one woman trying to love herself and others, readers find a wise and witty friend who will inspire them to forgive their own imperfections, make the most of their gifts, and commit to small acts of love that will change the world. ...more"},
{"title": "City of Ashes (The Mortal Instruments #2)", "product_description": "Also see: Alternate Cover Editions for this ISBN [ACE] ACE #1 Clary Fray just wishes that her life would go back to normal. But what's normal when you're a demon-slaying Shadowhunter, your mother is in a magically induced coma, and you can suddenly see Downworlders like werewolves, vampires, and faeries? If Clary left the world of the Shadowhunters behind, it would mean Also see: Alternate Cover Editions for this ISBN [ACE] ACE #1 Clary Fray just wishes that her life would go back to normal. But what's normal when you're a demon-slaying Shadowhunter, your mother is in a magically induced coma, and you can suddenly see Downworlders like werewolves, vampires, and faeries? If Clary left the world of the Shadowhunters behind, it would mean more time with her best friend, Simon, who's becoming more than a friend. But the Shadowhunting world isn't ready to let her go — especially her handsome, infuriating, newfound brother, Jace. And Clary's only chance to help her mother is to track down rogue Shadowhunter Valentine, who is probably insane, certainly evil — and also her father.To complicate matters, someone in New York City is murdering Downworlder children. Is Valentine behind the killings — and if he is, what is he trying to do? When the second of the Mortal Instruments, the Soul-Sword, is stolen, the terrifying Inquisitor arrives to investigate and zooms right in on Jace. How can Clary stop Valentine if Jace is willing to betray everything he believes in to help their father?In this breathtaking sequel to City of Bones, Cassandra Clare lures her readers back into the dark grip of New York City's Downworld, where love is never safe and power becomes the deadliest temptation. ...more"},
{"title": "City of Bones (The Mortal Instruments #1)", "product_description": "When fifteen-year-old Clary Fray heads out to the Pandemonium Club in New York City, she hardly expects to witness a murder― much less a murder committed by three teenagers covered with strange tattoos and brandishing bizarre weapons. Then the body disappears into thin air. It's hard to call the police when the murderers are invisible to everyone else and when there is not When fifteen-year-old Clary Fray heads out to the Pandemonium Club in New York City, she hardly expects to witness a murder― much less a murder committed by three teenagers covered with strange tattoos and brandishing bizarre weapons. Then the body disappears into thin air. It's hard to call the police when the murderers are invisible to everyone else and when there is nothing―not even a smear of blood―to show that a boy has died. Or was he a boy?This is Clary's first meeting with the Shadowhunters, warriors dedicated to ridding the earth of demons. It's also her first encounter with Jace, a Shadowhunter who looks a little like an angel and acts a lot like a jerk. Within twenty-four hours Clary is pulled into Jace's world with a vengeance, when her mother disappears and Clary herself is attacked by a demon. But why would demons be interested in ordinary mundanes like Clary and her mother? And how did Clary suddenly get the Sight? The Shadowhunters would like to know... Exotic and gritty, exhilarating and utterly gripping, Cassandra Clare's ferociously entertaining fantasy takes readers on a wild ride that they will never want to end. ...more"},
{"title": "City of Fallen Angels (The Mortal Instruments #4)", "product_description": "The Mortal War is over, and sixteen-year-old Clary Fray is back home in New York, excited about all the possibilities before her. She’s training to become a Shadowhunter and to use her unique power. Her mother is getting married to the love of her life. Downworlders and Shadowhunters are at peace at last. And—most importantly of all—she can finally call Jace her boyfriend. The Mortal War is over, and sixteen-year-old Clary Fray is back home in New York, excited about all the possibilities before her. She’s training to become a Shadowhunter and to use her unique power. Her mother is getting married to the love of her life. Downworlders and Shadowhunters are at peace at last. And—most importantly of all—she can finally call Jace her boyfriend.But nothing comes without a price.Someone is murdering Shadowhunters, provoking tensions between Downworlders and Shadowhunters that could lead to a second, bloody war. Clary’s best friend, Simon, can’t help her—his mother just found out that he’s a vampire, and now he’s homeless. When Jace begins to pull away from her without explaining why, Clary is forced to delve into the heart of a mystery whose solution reveals her worst nightmare: she herself has set in motion a terrible chain of events that could lead to her losing everything she loves. Even Jace. ...more"},
{"title": "Clockwork Angel (The Infernal Devices #1)", "product_description": "In a time when Shadowhunters are barely winning the fight against the forces of darkness, one battle will change the course of history forever. Welcome to the Infernal Devices trilogy, a stunning and dangerous prequel to the New York Times bestselling Mortal Instruments series.The year is 1878. Tessa Gray descends into London’s dark supernatural underworld in search of her In a time when Shadowhunters are barely winning the fight against the forces of darkness, one battle will change the course of history forever. Welcome to the Infernal Devices trilogy, a stunning and dangerous prequel to the New York Times bestselling Mortal Instruments series.The year is 1878. Tessa Gray descends into London’s dark supernatural underworld in search of her missing brother. She soon discovers that her only allies are the demon-slaying Shadowhunters—including Will and Jem, the mysterious boys she is attracted to. Soon they find themselves up against the Pandemonium Club, a secret organization of vampires, demons, warlocks, and humans. Equipped with a magical army of unstoppable clockwork creatures, the Club is out to rule the British Empire, and only Tessa and her allies can stop them... ...more"},
{"title": "Lady Midnight (The Dark Artifices #1)", "product_description": "In a kingdom by the sea…In a secret world where half-angel warriors are sworn to fight demons, parabatai is a sacred word.A parabatai is your partner in battle. A parabatai is your best friend. Parabatai can be everything to each other—but they can never fall in love.Emma Carstairs is a warrior, a Shadowhunter, and the best in her generation. She lives for battle. Shoulder In a kingdom by the sea…In a secret world where half-angel warriors are sworn to fight demons, parabatai is a sacred word.A parabatai is your partner in battle. A parabatai is your best friend. Parabatai can be everything to each other—but they can never fall in love.Emma Carstairs is a warrior, a Shadowhunter, and the best in her generation. She lives for battle. Shoulder to shoulder with her parabatai, Julian Blackthorn, she patrols the streets of Los Angeles, where vampires party on the Sunset Strip, and faeries—the most powerful of supernatural creatures—teeter on the edge of open war with Shadowhunters. When the bodies of humans and faeries turn up murdered in the same way Emma’s parents were when she was a child, an uneasy alliance is formed. This is Emma’s chance for revenge—and Julian’s chance to get back his brother Mark, who is being held prisoner by the faerie Courts. All Emma, Mark, and Julian have to do is solve the murders within two weeks…and before the murderer targets them.Their search takes Emma from sea caves full of sorcery to a dark lottery where death is dispensed. And each clue she unravels uncovers more secrets. What has Julian been hiding from her all these years? Why does Shadowhunter Law forbid parabatai to fall in love? Who really killed her parents—and can she bear to know the truth?The darkly magical world of Shadowhunters has captured the imaginations of millions of readers across the globe. Join the adventure in Lady Midnight, the long-awaited first volume of a new trilogy from Cassandra Clare. ...more"},
{"title": "Hush, Hush (Hush, Hush #1)", "product_description": "A SACRED OATHA FALLEN ANGELA FORBIDDEN LOVERomance was not part of Nora Grey's plan. She's never been particularly attracted to the boys at her school, no matter how hard her best friend, Vee, pushes them at her. Not until Patch comes along. With his easy smile and eyes that seem to see inside her, Patch draws Nora to him against her better judgment.But after a series of t A SACRED OATHA FALLEN ANGELA FORBIDDEN LOVERomance was not part of Nora Grey's plan. She's never been particularly attracted to the boys at her school, no matter how hard her best friend, Vee, pushes them at her. Not until Patch comes along. With his easy smile and eyes that seem to see inside her, Patch draws Nora to him against her better judgment.But after a series of terrifying encounters, Nora's not sure whom to trust. Patch seems to be everywhere she is and seems to know more about her than her closest friends. She can't decide whether she should fall into his arms or run and hide. And when she tries to seek some answers, she finds herself near a truth that is way more unsettling than anything Patch makes her feel.For she is right in the middle of an ancient battle between the immortal and those that have fallen - and, when it comes to choosing sides, the wrong choice will cost Nora her life. ...more"},
{"title": "Greek Mythic History", "product_description": "As far back as the fifth century BCE Pherecydes and others attempted to integrate city-state stories into a coherent mythic Greek pre-history. Science unavailable to ancient sources helped guide author Spencer Clevenger to critical insights and intriguing results. In Greek Mythic History, he weaves myths concerning gods, kings, and heroes into their intended time and pla As far back as the fifth century BCE Pherecydes and others attempted to integrate city-state stories into a coherent mythic Greek pre-history. Science unavailable to ancient sources helped guide author Spencer Clevenger to critical insights and intriguing results. In Greek Mythic History, he weaves myths concerning gods, kings, and heroes into their intended time and place and offers a concise retelling of Greek myths from a historic perspective. Capitalizing on modern discoveries, Clevenger tells the story in chronological order, starting with the creation of the cosmos and ending in the Dark Ages when poets began to write down their myths and stories. Neither history nor mythology, the stories depict what history might be if the myths were interpreted more literally.With maps and exhibits included, Greek Mythic History provides a comprehensive retelling of the various Hellenic myths in a logical historical sequence, and places nearly the entire canon into context. ...more"},
{"title": "Every Last Word", "product_description": "If you could read my mind, you wouldn't be smiling.Samantha McAllister looks just like the rest of the popular girls in her junior class. But hidden beneath the straightened hair and expertly applied makeup is a secret that her friends would never understand: Sam has Purely-Obsessional OCD and is consumed by a stream of dark thoughts and worries that she can't turn off. Se If you could read my mind, you wouldn't be smiling.Samantha McAllister looks just like the rest of the popular girls in her junior class. But hidden beneath the straightened hair and expertly applied makeup is a secret that her friends would never understand: Sam has Purely-Obsessional OCD and is consumed by a stream of dark thoughts and worries that she can't turn off. Second-guessing every move, thought, and word makes daily life a struggle, and it doesn't help that her lifelong friends will turn toxic at the first sign of a wrong outfit, wrong lunch, or wrong crush. Yet Sam knows she'd be truly crazy to leave the protection of the most popular girls in school. So when Sam meets Caroline, she has to keep her new friend with a refreshing sense of humor and no style a secret, right up there with Sam's weekly visits to her psychiatrist.Caroline introduces Sam to Poet's Corner, a hidden room and a tight-knit group of misfits who have been ignored by the school at large. Sam is drawn to them immediately, especially a guitar-playing guy with a talent for verse, and starts to discover a whole new side of herself. Slowly, she begins to feel more normal than she ever has as part of the popular crowd . . . until she finds a new reason to question her sanity and all she holds dear. ...more"},
{"title": "Daily Fantasy Sports", "product_description": "The businesses of the Fantasy Sports Trade Association have helped propel one of America’s most beloved pastimes into a 26 billion dollar industry. The advent of daily fantasy sports has created thousands of jobs, raised millions in tax dollars, and has given consumers endless ways to play fantasy sports. Unfortunately, all that may be coming to an end if the government an The businesses of the Fantasy Sports Trade Association have helped propel one of America’s most beloved pastimes into a 26 billion dollar industry. The advent of daily fantasy sports has created thousands of jobs, raised millions in tax dollars, and has given consumers endless ways to play fantasy sports. Unfortunately, all that may be coming to an end if the government and special interest groups have their way. Daily Fantasy Sports, the book, explores the impact of fantasy sports in America today. Take a stroll in fantasyland and discover everything there is to know about daily fantasy sports. Learn about the legal challenges, how we got in this mess, and what choices the industry now faces in order to save fantasy sports. The author helps you connect the dots, all while keeping you entertained with thoughtful quotes, tips on how to play, and more. Chapters include: Chapter 1 - It's a Game of Skill - explore how daily fantasy games are truly are a game of skill. Chapter 2 - Las Vegas & The Silver Bullet - see how Vegas is responsible for the legal mess. Chapter 3 - The Sharks & Players - numbers, demographics, and the shark problem. Chapter 4 - It's the Economy Stupid - how the government can't get out of its own way. Chapter 5 - The Technology Cat Mouse Game - predictions about the future and how DFS will evolve. Chapter 6 - The Types of Daily Fantasy Games - learn about all the different gameplay styles. Chapter 7 - How to be Good at Fantasy Sports - tips, insight, and advice on how to up your game. Chapter 8 - Behind the Scenes Magic - explore the businesses that make fantasy sports what it is today. Chapter 9 - Thoughts from the Industry - see what industry insiders have to say about fantasy sports. Chapter 10 - Freedom with Responsibility - why free market principals are all we need. Chapter 11 - Keep Fighting the Good Fight - what we can do to combat the downfall of DFS. The author's collective knowledge of the fantasy sports industry is virtually unparalleled, giving readers an in depth look at daily fantasy sports they won't find anywhere else. His involvement with a variety of industry operators, attorneys, and FSTA businesses places him in a net neutral position that allows readers to see the industry for what it really is. Fantasy sports players and industry insiders alike have sang high praises about this one of a kind book on daily fantasy sports. ...more"},
{"title": "Living Leadership by Insight: A Good Leader Achieves, a Great Leader Builds Monuments", "product_description": "Learning not shared is learning wasted. In my thirty-five years of experience in the oil and banking industries, including ascending levels of management and leadership responsibilities, I have gained what I believe to be valuable insight into many styles of leadership. Former President of the United States, Harry S. Truman, once said “It’s what you learn after you know it Learning not shared is learning wasted. In my thirty-five years of experience in the oil and banking industries, including ascending levels of management and leadership responsibilities, I have gained what I believe to be valuable insight into many styles of leadership. Former President of the United States, Harry S. Truman, once said “It’s what you learn after you know it all that really counts.” We must continue our education if we want to keep pace with progress. The learning process that begins with our parents and through the influence of others with whom we associate continues throughout life. The insight I have received into what is successful has been clearly revealed through years of experience. There have been failures and there have been successes and it has not been difficult to discern the reasons for either. Careful thought has led to the extraction of the traits and characteristics that provide a leader with the best chance of success and they are delineated in this book. We should all be teachers and mentors and strive to improve the lives of those with whom we become associated. Our legacy in life is to live on through the lives of those we have touched. This book will enlighten you about the successful strategies I have employed in a myriad of situations as a leader and manager. ...more"},
{"title": "Luckiest Girl Alive", "product_description": "HER PERFECT LIFE IS A PERFECT LIE.As a teenager at the prestigious Bradley School, Ani FaNelli endured a shocking, public humiliation that left her desperate to reinvent herself. Now, with a glamorous job, expensive wardrobe, and handsome blue blood fiancé, she’s this close to living the perfect life she’s worked so hard to achieve.But Ani has a secret.There’s something el HER PERFECT LIFE IS A PERFECT LIE.As a teenager at the prestigious Bradley School, Ani FaNelli endured a shocking, public humiliation that left her desperate to reinvent herself. Now, with a glamorous job, expensive wardrobe, and handsome blue blood fiancé, she’s this close to living the perfect life she’s worked so hard to achieve.But Ani has a secret.There’s something else buried in her past that still haunts her, something private and painful that threatens to bubble to the surface and destroy everything.With a singular voice and twists you won’t see coming, Luckiest Girl Alive explores the unbearable pressure that so many women feel to “have it all” and introduces a heroine whose sharp edges and cutthroat ambition have been protecting a scandalous truth, and a heart that's bigger than it first appears.The question remains: will breaking her silence destroy all that she has worked for—or, will it at long last, set Ani free? ...more"},
{"title": "Steve Jobs", "product_description": "From best-selling author Walter Isaacson comes the landmark biography of Apple co-founder Steve Jobs.In Steve Jobs: The Exclusive Biography, Isaacson provides an extraordinary account of Jobs' professional and personal life. Drawn from three years of exclusive and unprecedented interviews Isaacson has conducted with Jobs as well as extensive interviews with Jobs' family me From best-selling author Walter Isaacson comes the landmark biography of Apple co-founder Steve Jobs.In Steve Jobs: The Exclusive Biography, Isaacson provides an extraordinary account of Jobs' professional and personal life. Drawn from three years of exclusive and unprecedented interviews Isaacson has conducted with Jobs as well as extensive interviews with Jobs' family members and key colleagues from Apple and its competitors, Steve Jobs: The Exclusive Biography is the definitive portrait of the greatest innovator of his generation. ...more"},
{"title": "Left Behind (Left Behind #1)", "product_description": "An airborne Boeing 747 is headed to London when, without any warning, passengers mysteriously disappear from their seats. Terror and chaos slowly spread not only through the plane but also worldwide as unusual events continue to unfold. For those who have been left behind, the apocalypse has just begun"},
{"title": "The Power of Habit: Why We Do What We Do in Life and Business", "product_description": "A young woman walks into a laboratory. Over the past two years, she has transformed almost every aspect of her life. She has quit smoking, run a marathon, and been promoted at work. The patterns inside her brain, neurologists discover, have fundamentally changed.Marketers at Procter & Gamble study videos of people making their beds. They are desperately trying to figur A young woman walks into a laboratory. Over the past two years, she has transformed almost every aspect of her life. She has quit smoking, run a marathon, and been promoted at work. The patterns inside her brain, neurologists discover, have fundamentally changed. Marketers at Procter & Gamble study videos of people making their beds. They are desperately trying to figure out how to sell a new product called Febreze, on track to be one of the biggest flops in company history. Suddenly, one of them detects a nearly imperceptible pattern—and with a slight shift in advertising, Febreze goes on to earn a billion dollars a year. An untested CEO takes over one of the largest companies in America. His first order of business is attacking a single pattern among his employees—how they approach worker safety—and soon the firm, Alcoa, becomes the top performer in the Dow Jones. What do all these people have in common? They achieved success by focusing on the patterns that shape every aspect of our lives.  They succeeded by transforming habits. In The Power of Habit, award-winning New York Times business reporter Charles Duhigg takes us to the thrilling edge of scientific discoveries that explain why habits exist and how they can be changed. With penetrating intelligence and an ability to distill vast amounts of information into engrossing narratives, Duhigg brings to life a whole new understanding of human nature and its potential for transformation.  Along the way we learn why some people and companies struggle to change, despite years of trying, while others seem to remake themselves overnight. We visit laboratories where neuroscientists explore how habits work and where, exactly, they reside in our brains. We discover how the right habits were crucial to the success of Olympic swimmer Michael Phelps, Starbucks CEO Howard Schultz, and civil-rights hero Martin Luther King, Jr. We go inside Procter & Gamble, Target superstores, Rick Warren’s Saddleback Church, NFL locker rooms, and the nation’s largest hospitals and see how implementing so-called keystone habits can earn billions and mean the difference between failure and success, life and death. At its core, The Power of Habit contains an exhilarating argument: The key to exercising regularly, losing weight, raising exceptional children, becoming more productive, building revolutionary companies and social movements, and achieving success is understanding how habits work.  Habits aren’t destiny. As Charles Duhigg shows, by harnessing this new science, we can transform our businesses, our communities, and our lives. ...more"},
{"title": "The Rosie Project (Don Tillman #1)", "product_description": "An international sensation, this hilarious, feel-good novel is narrated by an oddly charming and socially challenged genetics professor on an unusual quest: to find out if he is capable of true love.Don Tillman, professor of genetics, has never been on a second date. He is a man who can count all his friends on the fingers of one hand, whose lifelong difficulty with social An international sensation, this hilarious, feel-good novel is narrated by an oddly charming and socially challenged genetics professor on an unusual quest: to find out if he is capable of true love.Don Tillman, professor of genetics, has never been on a second date. He is a man who can count all his friends on the fingers of one hand, whose lifelong difficulty with social rituals has convinced him that he is simply not wired for romance. So when an acquaintance informs him that he would make a “wonderful” husband, his first reaction is shock. Yet he must concede to the statistical probability that there is someone for everyone, and he embarks upon The Wife Project. In the orderly, evidence-based manner with which he approaches all things, Don sets out to find the perfect partner. She will be punctual and logical—most definitely not a barmaid, a smoker, a drinker, or a late-arriver.Yet Rosie Jarman is all these things. She is also beguiling, fiery, intelligent—and on a quest of her own. She is looking for her biological father, a search that a certain DNA expert might be able to help her with. Don's Wife Project takes a back burner to the Father Project and an unlikely relationship blooms, forcing the scientifically minded geneticist to confront the spontaneous whirlwind that is Rosie—and the realization that love is not always what looks good on paper.The Rosie Project is a moving and hilarious novel for anyone who has ever tenaciously gone after life or love in the face of overwhelming challenges. ...more"},
{"title": "John Vassos: Industrial Design for Modern Life", "product_description": "What should a television look like? How should a dial on a radio feel to the touch? These were questions John Vassos asked when the Radio Corporation of America (RCA) asked him to design the first mass-produced television receiver, the TRK-12, which had its spectacular premier at the 1939 New York World’s Fair. Vassos emigrated from Greece and arrived in the United States What should a television look like? How should a dial on a radio feel to the touch? These were questions John Vassos asked when the Radio Corporation of America (RCA) asked him to design the first mass-produced television receiver, the TRK-12, which had its spectacular premier at the 1939 New York World’s Fair. Vassos emigrated from Greece and arrived in the United States in 1918. His career spans the evolution of central forms of mass media in the twentieth century and offers a template for understanding their success. This is Vassos’s legacy—shaping the way we interact with our media technologies. Other industrial designers may be more celebrated, but none were more focused on making radio and television attractive and accessible to millions of Americans.In John Vassos: Industrial Design for Modern Life, Danielle Shapiro is the first to examine the life and work of RCA’s key consultant designer through the rise of radio and television and into the computer era. Vassos conceived a vision for the look of new technologies still with us today. A founder of the Industrial Designers Society of America, he was instrumental in the development of a self-conscious industrial design profession during the late 1920s and 1930s and into the postwar period. Drawing on unpublished records and correspondence, Shapiro creates a portrait of a designer whose early artistic work in books like Phobia and Contempo critiqued the commercialization of modern life but whose later design work sought to accommodate it.Replete with rich behind-the-product stories of America’s design culture in the 1930s through the 1950s, this volume also chronicles the emergence of what was to become the nation’s largest media company and provides a fascinating glimpse into its early corporate culture. In our current era of watching TV on an iPod or a smartphone, Shapiro stimulates broad discussions of the meaning of technological design for mass media in daily life. ...more"},
{"title": "I'll Give You the Sun", "product_description": "A brilliant, luminous story of first love, family, loss, and betrayal for fans of John Green, David Levithan, and Rainbow Rowell Jude and her twin brother, Noah, are incredibly close. At thirteen, isolated Noah draws constantly and is falling in love with the charismatic boy next door, while daredevil Jude cliff-dives and wears red-red lipstick and does the talking for bo A brilliant, luminous story of first love, family, loss, and betrayal for fans of John Green, David Levithan, and Rainbow Rowell Jude and her twin brother, Noah, are incredibly close. At thirteen, isolated Noah draws constantly and is falling in love with the charismatic boy next door, while daredevil Jude cliff-dives and wears red-red lipstick and does the talking for both of them. But three years later, Jude and Noah are barely speaking. Something has happened to wreck the twins in different and dramatic ways . . . until Jude meets a cocky, broken, beautiful boy, as well as someone else—an even more unpredictable new force in her life. The early years are Noah's story to tell. The later years are Jude's. What the twins don't realize is that they each have only half the story, and if they could just find their way back to one another, they’d have a chance to remake their world. This radiant novel from the acclaimed, award-winning author of The Sky Is Everywhere will leave you breathless and teary and laughing—often all at once. ...more"},
{"title": "The Martian (The Martian #1)", "product_description": "A mission to Mars.A freak accident.One man's struggle to survive.Six days ago, astronaut Mark Watney became one of the first people to walk on Mars. Now, he's sure he'll be the first person to die there.After a dust storm nearly kills him and forces his crew to evacuate the planet while thinking him dead, Mark finds himself stranded on Mars' surface, completely alone, with A mission to Mars.A freak accident.One man's struggle to survive.Six days ago, astronaut Mark Watney became one of the first people to walk on Mars. Now, he's sure he'll be the first person to die there.After a dust storm nearly kills him and forces his crew to evacuate the planet while thinking him dead, Mark finds himself stranded on Mars' surface, completely alone, with no way to signal Earth that he’s alive. And even if he could get word out, his supplies would be gone years before a rescue could arrive.Chances are, though, Mark won't have time to starve to death. The damaged machinery, unforgiving environment or plain-old human error are much more likely to kill him first. But Mark's not ready to quit. Armed with nothing but his ingenuity and his engineering skills—and a gallows sense of humor that proves to be his greatest source of strength–he embarks on a dogged quest to stay alive, using his botany expertise to grow food and even hatching a mad plan to contact NASA back on Earth.As he overcomes one seemingly insurmountable obstacle after the next, Mark begins to let himself believe he might make it off the planet alive.But Mars has plenty of surprises in store for him yet.Grounded in real, present-day science from the first page to the last, yet propelled by a brilliantly ingenious plot that surprises the reader again and again, The Martian is a truly remarkable thriller: an impossible-to-put-down suspense novel that manages to read like a real-life survival tale. ...more"},
{"title": "The Unlikely Pilgrimage of Harold Fry (Harold Fry #1)", "product_description": "Harold Fry is convinced that he must deliver a letter to an old friend in order to save her, meeting various characters along the way and reminiscing about the events of his past and people he has known, as he tries to find peace and acceptance.Recently retired, sweet, emotionally numb Harold Fry is jolted out of his passivity by a letter from Queenie Hennessy, an old frie Harold Fry is convinced that he must deliver a letter to an old friend in order to save her, meeting various characters along the way and reminiscing about the events of his past and people he has known, as he tries to find peace and acceptance.Recently retired, sweet, emotionally numb Harold Fry is jolted out of his passivity by a letter from Queenie Hennessy, an old friend, who he hasn't heard from in twenty years. She has written to say she is in hospice and wanted to say goodbye. Leaving his tense, bitter wife Maureen to her chores, Harold intends a quick walk to the corner mailbox to post his reply but instead, inspired by a chance encounter, he becomes convinced he must deliver his message in person to Queenie--who is 600 miles away--because as long as he keeps walking, Harold believes that Queenie will not die. So without hiking boots, rain gear, map or cell phone, one of the most endearing characters in current fiction begins his unlikely pilgrimage across the English countryside. Along the way, strangers stir up memories--flashbacks, often painful, from when his marriage was filled with promise and then not, of his inadequacy as a father, and of his shortcomings as a husband. Ironically, his wife Maureen, shocked by her husband's sudden absence, begins to long for his presence. Is it possible for Harold and Maureen to bridge the distance between them? And will Queenie be alive to see Harold arrive at her door? ...more"},
{"title": "Modern Day Fables", "product_description": "It is difficult to accurately summarize eleven very different stories, each of which stands alone. However, if there is a recurring theme in Modern Day Fables it is that of the eternal conflict between the individual and society, between the unique and the formulaic. Each story, or fable, looks at the issue from a different angle, and does so specifically within the contex It is difficult to accurately summarize eleven very different stories, each of which stands alone. However, if there is a recurring theme in Modern Day Fables it is that of the eternal conflict between the individual and society, between the unique and the formulaic. Each story, or fable, looks at the issue from a different angle, and does so specifically within the context of the current way of thinking in the world.• The book’s first story, Screen, takes place in the near future where a technological innovation allows for the majority of life to be lived inside a virtual world. As life in the real world becomes more and more scarce, and a strange illness starts spreading throughout the population, a young woman named Misha finds herself drawn deep into the true nature of a sinister company called SciTech.• In The IV Club, a new extracurricular group forms at Glenwood High. Led by a charismatic teacher, it promises relief from suffering through the recognition that we are all innocent victims. While it catches on like wildfire throughout the school and beyond, one student’s skepticism leads her to uncover what the aim of the club really is.• A young man who has recently graduated college finds himself struggling with where to go in his life in the story, Precipice. After Jake ends up aimlessly walking the campus of his old university one night with a friend, what starts as a nostalgic trip down memory lane quickly turns into a nightmare. A mysterious ally, hostile pursuers, and some suddenly not-so-familiar faces lead him to the verge of a decision that will decide his fate.Within these stories, as well as the rest in the book, you will see the ideals and expectations of society destroy some characters, as well as be exploited by others for power. But most importantly you will find those rare individuals who discover the courage inherent within them to stand apart from the status quo. They are not fearless heroes, but normal everyday people, conflicted yet confident, fearful yet bold. It is within these characters that lessons of the fables lie. ...more"},
{"title": "NaNo What Now? Finding your editing process, revising your NaNoWriMo book and building a writing career through publishing and beyond", "product_description": "You’ve just completed a novel during the National Novel Writing Month challenge! Or maybe you completed part of one. Or signed up with really good intentions and then only wrote a couple of words. Either way, you’re staring at 30 days worth of words and wondering… What now? How exactly do you start a revision and discover your editing process? How do you know if you’re rea You’ve just completed a novel during the National Novel Writing Month challenge! Or maybe you completed part of one. Or signed up with really good intentions and then only wrote a couple of words. Either way, you’re staring at 30 days worth of words and wondering… What now? How exactly do you start a revision and discover your editing process? How do you know if you’re ready to hire an editor? How do you motivate yourself when faced with draft dread or editing blocks? How can you translate what you’ve accomplished so far into a professional writing career? From tips for finding beta readers, exploration of traditional vs. self-publishing, and strategies to motivate yourself to keep writing regularly post-NaNoWriMo, NaNo What Now? is a quick and easy-to-read unofficial guide to the next steps. In a sea of general writing advice, NaNo ML and multi-year veteran Hillary DePiano offers practical and specific solutions tailored to the unique nature of the NaNoWriMo challenge and holds your hand through the rest of the journey. It’s time to finish what you started and make your book the best it can be. ...more"},
{"title": "Underlying Notes", "product_description": "Carla Matteo copes with life by tipping the bottle--glass goddesses funneling perfume! During a midlife renaissance, the juice enables Carla to find her own niche, while the ominous rose note in Paloma Picasso forces her to confront the past."},
{"title": "The Flowers Lied", "product_description": "Remember back when you first wanted to become a rock critic? Or when you first started to read music reviews? Those are the days of The Flowers Lied, Michael Goldberg's new rock ‘n’ roll coming-of-age novel. Writerman, the narrator, is a rock critic wannabe obsessed with music – favorites include Captain Beefheart, the Blue Oyster Cult, the 13th Floor Elevators, John Coltr Remember back when you first wanted to become a rock critic? Or when you first started to read music reviews? Those are the days of The Flowers Lied, Michael Goldberg's new rock ‘n’ roll coming-of-age novel. Writerman, the narrator, is a rock critic wannabe obsessed with music – favorites include Captain Beefheart, the Blue Oyster Cult, the 13th Floor Elevators, John Coltrane, Pearls Before Swine, Slim Harpo, Neil Young, Sam Rivers and, of course, Bob Dylan. This novel is for anyone who grew up in the ‘60s or '70s—or anyone who wondered what it was really like to be a teenager back then.Witness Writerman fighting his record buying addition at Odyssey Records as store owner Lucky Larry guzzles Green Death and applies the “upsell, attending a Neil Young concert in 1973 and confronting Neil backstage, pursuing the Visions of Johanna chick of his dreams and ending up naked at the top of a Ferris wheel, alone with his best friend’s girl. ...more"},
{"title": "The New Brand You: Your New Image Makes the Sale for You", "product_description": "You want people to recognize you, like you, and trust you, so they buy from you. You may have already branded yourself with this in mind but perhaps you’re not getting the desired results. Many people think that branding is about cool logos, fancy websites and social media popularity. But this line of thought causes potential successes to fail.So what does work? In The New You want people to recognize you, like you, and trust you, so they buy from you. You may have already branded yourself with this in mind but perhaps you’re not getting the desired results. Many people think that branding is about cool logos, fancy websites and social media popularity. But this line of thought causes potential successes to fail.So what does work? In The New Brand You, Julie Broad, MBA, bestselling author, popular speaker, and award winning entrepreneur, shares the secrets of creating a trusted brand.You’ll learn what is critical in reinventing your personal brand, and why you may never have to tweet, pin or post to do it. Did you know that …?• Your brand is first of all about the feelings, thoughts and experiences of your customers and clients.• There are at least 42 common communication mistakes that dilute your message, and only two things you have to do to have a brand with big impact.• Online, you are who Google says you are …The New Brand You is your detailed guidebook to successfully recreating your brand and attracting your ideal clients. ...more"},
{"title": "Unlimited Intuition Now", "product_description": "Read Unlimited Intuition Now to develop your own psychic abilities so that you can receive guidance from your soul.How you will benefit:Pray to open your soul guidanceLearn how to read the energy in your chakras with a pendulumTune in to read your own bodyDiscover how to read the body of another personDiscern how much life force is in your foodFocus to tell if food is real Read Unlimited Intuition Now to develop your own psychic abilities so that you can receive guidance from your soul.How you will benefit:Pray to open your soul guidanceLearn how to read the energy in your chakras with a pendulumTune in to read your own bodyDiscover how to read the body of another personDiscern how much life force is in your foodFocus to tell if food is really good for your bodyPractice how to muscle test yourselfRaise your vibration to listen to your angelsGet your ego out of the way so you can listen to divine guidanceStay connected with loved ones when you are apartOpen your psychic centers of clairaudience, claircognizance, clairsentience and clairvoyanceAvoid other people’s ego projections to see what’s really going onProtect your energy so you feel safe and grounded at all times and in all placesStay out of trouble in dangerous situationsUnderstand how your different psychic gifts actually workDeepen your connection to God and feel supported on all levels ...more"},
{"title": "The Great Gatsby", "product_description": "THE GREAT GATSBY, F. Scott Fitzgerald’s third book, stands as the supreme achievement of his career. This exemplary novel of the Jazz Age has been acclaimed by generations of readers. The story of the fabulously wealthy Jay Gatsby and his love for the beautiful Daisy Buchanan, of lavish parties on Long Island at a time when The New York Times noted “gin was the national dr THE GREAT GATSBY, F. Scott Fitzgerald’s third book, stands as the supreme achievement of his career. This exemplary novel of the Jazz Age has been acclaimed by generations of readers. The story of the fabulously wealthy Jay Gatsby and his love for the beautiful Daisy Buchanan, of lavish parties on Long Island at a time when The New York Times noted “gin was the national drink and sex the national obsession,” it is an exquisitely crafted tale of America in the 1920s.The Great Gatsby is one of the great classics of twentieth-century literature. ...more"},
{"title": "The Year of Living Biblically: One Man's Humble Quest to Follow the Bible as Literally as Possible", "product_description": "From the bestselling author of The Know-It-All comes a fascinating and timely exploration of religion and the Bible.Raised in a secular family but increasingly interested in the relevance of faith in our modern world, A.J. Jacobs decides to dive in headfirst and attempt to obey the Bible as literally as possible for one full year. He vows to follow the Ten Commandments. From the bestselling author of The Know-It-All comes a fascinating and timely exploration of religion and the Bible.Raised in a secular family but increasingly interested in the relevance of faith in our modern world, A.J. Jacobs decides to dive in headfirst and attempt to obey the Bible as literally as possible for one full year. He vows to follow the Ten Commandments. To be fruitful and multiply. To love his neighbor. But also to obey the hundreds of less publicized rules: to avoid wearing clothes made of mixed fibers; to play a ten-string harp; to stone adulterers.The resulting spiritual journey is at once funny and profound, reverent and irreverent, personal and universal and will make you see history's most influential book with new eyes.Jacobs's quest transforms his life even more radically than the year spent reading the entire Encyclopedia Britannica for The Know-It-All. His beard grows so unruly that he is regularly mistaken for a member of ZZ Top. He immerses himself in prayer, tends sheep in the Israeli desert, battles idolatry, and tells the absolute truth in all situations - much to his wife's chagrin.Throughout the book, Jacobs also embeds himself in a cross-section of communities that take the Bible literally. He tours a Kentucky-based creationist museum and sings hymns with Pennsylvania Amish. He dances with Hasidic Jews in Brooklyn and does Scripture study with Jehovah's Witnesses. He discovers ancient biblical wisdom of startling relevance. And he wrestles with seemingly archaic rules that baffle the twenty-first-century brain.Jacobs's extraordinary undertaking yields unexpected epiphanies and challenges. A book that will charm readers both secular and religious, The Year of Living Biblically is part Cliff Notes to the Bible, part memoir, and part look into worlds unimaginable. Thou shalt not be able to put it down. ...more"},
{"title": "Ender's Game (The Ender Quintet #1)", "product_description": "Andrew Ender Wiggin thinks he is playing computer simulated war games; he is, in fact, engaged in something far more desperate. The result of genetic experimentation, Ender may be the military genius Earth desperately needs in a war against an alien enemy seeking to destroy all human life. The only way to find out is to throw Ender into ever harsher training, to chip awa Andrew Ender Wiggin thinks he is playing computer simulated war games; he is, in fact, engaged in something far more desperate. The result of genetic experimentation, Ender may be the military genius Earth desperately needs in a war against an alien enemy seeking to destroy all human life. The only way to find out is to throw Ender into ever harsher training, to chip away and find the diamond inside, or destroy him utterly. Ender Wiggin is six years old when it begins. He will grow up fast.But Ender is not the only result of the experiment. The war with the Buggers has been raging for a hundred years, and the quest for the perfect general has been underway almost as long. Ender's two older siblings, Peter and Valentine, are every bit as unusual as he is, but in very different ways. While Peter was too uncontrollably violent, Valentine very nearly lacks the capability for violence altogether. Neither was found suitable for the military's purpose. But they are driven by their jealousy of Ender, and by their inbred drive for power. Peter seeks to control the political process, to become a ruler. Valentine's abilities turn more toward the subtle control of the beliefs of commoner and elite alike, through powerfully convincing essays. Hiding their youth and identities behind the anonymity of the computer networks, these two begin working together to shape the destiny of Earth-an Earth that has no future at all if their brother Ender fails.~from author's web site ...more"},
{"title": "Heaven is for Real: A Little Boy's Astounding Story of His Trip to Heaven and Back", "product_description": "A beautifully written glimpse into heaven that will encourage those who doubtand thrill those who believe.Ron Hall, coauthor of Same Kind of Different as MeDo you remember the hospital, Colton? Sonja said. Yes, mommy, I remember, he said. That s where theangels sang to me.When Colton Burpo made it through an emergency appendectomy, his familywas overjoyed at his miraculous A beautifully written glimpse into heaven that will encourage those who doubtand thrill those who believe.Ron Hall, coauthor of Same Kind of Different as MeDo you remember the hospital, Colton? Sonja said. Yes, mommy, I remember, he said. That s where theangels sang to me.When Colton Burpo made it through an emergency appendectomy, his familywas overjoyed at his miraculous survival. What they weren t expecting, though, was the story that emerged in the months that followed a story as beautiful as itwas extraordinary, detailing their little boy s trip to heaven and back.Colton, not yet four years old, told his parents he left his body during thesurgery and authenticated that claim by describing exactly what his parents weredoing in another part of the hospital while he was being operated on. He talked ofvisiting heaven and relayed stories told to him by people he met there whom hehad never met in life, sharing events that happened even before he was born. He also astonished his parents with descriptions and obscure details about heaven thatmatched the Bible exactly, though he had not yet learned to read.With disarming innocence and the plainspoken boldness of a child, Colton tells of meeting long-departed family members. He describes Jesus, the angels, how really, really big God is, and how much God loves us. Retold by his father, but using Colton s uniquely simple words, Heaven Is for Real offers a glimpseof the world that awaits us, where as Colton says, Nobody is old and nobodywears glasses.Heaven Is for Real will forever change the way you think of eternity, offeringthe chance to see, and believe, like a child. ...more"},
{"title": "Adultery", "product_description": "I want to change. I need to change. I'm gradually losing touch with myself. Adultery, the provocative new novel by Paulo Coelho, best-selling author of The Alchemist and Eleven Minutes, explores the question of what it means to live life fully and happily, finding the balance between life's routine and the desire for something new."},
{"title": "Death by Leisure: A Cautionary Tale", "product_description": "The hilariously intrepid young author of War Reporting for Cowards returns from Iraq only to dive head-first into another absurd, terrifying world: the American leisure class. Like Hunter Thompson crossed with one of David Brooks’s bobos in paradise, Ayres embeds himself in LA’s “liesuretocracy”: an over-the-top world of caviar facials, billionaire charity balls, souped-up The hilariously intrepid young author of War Reporting for Cowards returns from Iraq only to dive head-first into another absurd, terrifying world: the American leisure class. Like Hunter Thompson crossed with one of David Brooks’s bobos in paradise, Ayres embeds himself in LA’s “liesuretocracy”: an over-the-top world of caviar facials, billionaire charity balls, souped-up SUVs, and monster home loans . . . not to mention $1,000-a-night brothels and million-dollar poker tournaments. Ayres’s highly leveraged lifestyle lands him a surreal night with a supermodel, a date at Michael Jackson’s birthday party in Neverland Ranch (Ayres bribes the organizers five grand to get in), and a wife courtesy of Craigslist. But disaster is never far away. In the book’s brutal final section, Ayres is forced to confront the excesses of his generation at a scene of apocalyptic destruction: the Katrina-ravaged South. Told with a blend of offbeat irreverence, genuine pathos, and incisive social commentary, Death by Leisure is a savage and darkly humorous odyssey that taps directly into the contemporary psyche. ...more"},
{"title": "Wildlife of New York: A Five-Borough Coloring Book", "product_description": "Explore lively streets, scenic parks, and teeming waterfronts in Wildlife of New York, a coloring adventure that celebrates the vibrant, humming energy of New York City and its surprisingly varied animal life.Artist Giada Crispiels’ playful scenes highlight beloved landmarks from all five boroughs—like Central Park, Coney Island, and the New York Botanical Garden—alongside Explore lively streets, scenic parks, and teeming waterfronts in Wildlife of New York, a coloring adventure that celebrates the vibrant, humming energy of New York City and its surprisingly varied animal life.Artist Giada Crispiels’ playful scenes highlight beloved landmarks from all five boroughs—like Central Park, Coney Island, and the New York Botanical Garden—alongside charming neighborhood nooks and crannies. There are dozens of animals, from common squirrels to eagles and coyotes, that thrive in every corner of the urban jungle. The animals, as well as all of the featured locations, are described in lively captions at the back of the book.Selected to fit any reader’s preference, Wildlife of New York’s artist quality paper reflects any coloring implement’s hue—whether it be markers, pens, or coloring pencils—in arresting blends and bold vividness. Packed with enchanting details, it will provide hours of fun for colorists of all ages, while opening their eyes to the amazing ecological diversity of even the most bustling cityscape. ...more"},
{"title": "Troublemaker: Surviving Hollywood and Scientology", "product_description": "The outspoken actress, talk show host, and reality television star offers up a no-holds-barred memoir, including an eye-opening insider account of her tumultuous and heart-wrenching thirty-year-plus association with the Church of Scientology.Leah Remini has never been the type to hold her tongue. That willingness to speak her mind, stand her ground, and rattle the occasion The outspoken actress, talk show host, and reality television star offers up a no-holds-barred memoir, including an eye-opening insider account of her tumultuous and heart-wrenching thirty-year-plus association with the Church of Scientology.Leah Remini has never been the type to hold her tongue. That willingness to speak her mind, stand her ground, and rattle the occasional cage has enabled this tough-talking girl from Brooklyn to forge an enduring and successful career in Hollywood. But being a troublemaker has come at a cost.That was never more evident than in 2013, when Remini loudly and publicly broke with the Church of Scientology. Now, in this frank, funny, poignant memoir, the former King of Queens star opens up about that experience for the first time, revealing the in-depth details of her painful split with the church and its controversial practices.Indoctrinated into the church as a child while living with her mother and sister in New York, Remini eventually moved to Los Angeles, where her dreams of becoming an actress and advancing Scientology’s causes grew increasingly intertwined. As an adult, she found the success she’d worked so hard for, and with it a prominent place in the hierarchy of celebrity Scientologists alongside people such as Tom Cruise, Scientology’s most high-profile adherent. Remini spent time directly with Cruise and was included among the guests at his 2006 wedding to Katie Holmes.But when she began to raise questions about some of the church’s actions, she found herself a target. In the end, she was declared by the church to be a threat to their organization and therefore a “Suppressive Person,” and as a result, all of her fellow parishioners—including members of her own family—were told to disconnect from her. Forever.Bold, brash, and bravely confessional, Troublemaker chronicles Leah Remini’s remarkable journey toward emotional and spiritual freedom, both for herself and for her family. This is a memoir designed to reveal the hard-won truths of a life lived honestly—from an author unafraid of the consequences. ...more"},
{"title": "Eleanor & Park", "product_description": "Two misfits.One extraordinary love.Eleanor... Red hair, wrong clothes. Standing behind him until he turns his head. Lying beside him until he wakes up. Making everyone else seem drabber and flatter and never good enough...Eleanor.Park... He knows she'll love a song before he plays it for her. He laughs at her jokes before she ever gets to the punch line. There's a place on Two misfits.One extraordinary love.Eleanor... Red hair, wrong clothes. Standing behind him until he turns his head. Lying beside him until he wakes up. Making everyone else seem drabber and flatter and never good enough...Eleanor.Park... He knows she'll love a song before he plays it for her. He laughs at her jokes before she ever gets to the punch line. There's a place on his chest, just below his throat, that makes her want to keep promises...Park.Set over the course of one school year, this is the story of two star-crossed sixteen-year-olds—smart enough to know that first love almost never lasts, but brave and desperate enough to try. ...more"},
{"title": "Shiver (The Wolves of Mercy Falls #1)", "product_description": "For years, Grace has watched the wolves in the woods behind her house. One yellow-eyed wolf—her wolf—is a chilling presence she can't seem to live without.Meanwhile, Sam has lived two lives: In winter, the frozen woods, the protection of the pack, and the silent company of a fearless girl. In summer, a few precious months of being human… until the cold makes him shift back For years, Grace has watched the wolves in the woods behind her house. One yellow-eyed wolf—her wolf—is a chilling presence she can't seem to live without.Meanwhile, Sam has lived two lives: In winter, the frozen woods, the protection of the pack, and the silent company of a fearless girl. In summer, a few precious months of being human… until the cold makes him shift back again.Now, Grace meets a yellow-eyed boy whose familiarity takes her breath away. It's her wolf. It has to be. But as winter nears, Sam must fight to stay human—or risk losing himself, and Grace, forever. ...more"},
{"title": "Harry Potter and the Deathly Hallows (Harry Potter #7)", "product_description": "Harry is waiting in Privet Drive. The Order of the Phoenix is coming to escort him safely away without Voldemort and his supporters knowing - if they can. But what will Harry do then? How can he fulfil the momentous and seemingly impossible task that Professor Dumbledore has left him?"},
{"title": "The Dream Thieves (The Raven Cycle #2)", "product_description": "If you could steal things from dreams, what would you take?Ronan Lynch has secrets. Some he keeps from others. Some he keeps from himself.One secret: Ronan can bring things out of his dreams.And sometimes he's not the only one who wants those things.Ronan is one of the raven boys—a group of friends, practically brothers, searching for a dead king named Glendower, who they If you could steal things from dreams, what would you take?Ronan Lynch has secrets. Some he keeps from others. Some he keeps from himself.One secret: Ronan can bring things out of his dreams.And sometimes he's not the only one who wants those things.Ronan is one of the raven boys—a group of friends, practically brothers, searching for a dead king named Glendower, who they think is hidden somewhere in the hills by their elite private school, Aglionby Academy. The path to Glendower has long lived as an undercurrent beneath town. But now, like Ronan's secrets, it is beginning to rise to the surface—changing everything in its wake.Of The Raven Boys, Entertainment Weekly wrote, Maggie Stiefvater's can't-put-it-down paranormal adventure will leave you clamoring for book two. Now the second book is here, with the same wild imagination, dark romance, and heart-stopping twists that only Maggie Stiefvater can conjure. ...more"},
{"title": "Remember Me?", "product_description": "When twenty-eight-year-old Lexi Smart wakes up in a London hospital, she’s in for a big surprise. Her teeth are perfect. Her body is toned. Her handbag is Vuitton. Having survived a car accident—in a Mercedes no less—Lexi has lost a big chunk of her memory, three years to be exact, and she’s about to find out just how much things have changed.Somehow Lexi went from a twent When twenty-eight-year-old Lexi Smart wakes up in a London hospital, she’s in for a big surprise. Her teeth are perfect. Her body is toned. Her handbag is Vuitton. Having survived a car accident—in a Mercedes no less—Lexi has lost a big chunk of her memory, three years to be exact, and she’s about to find out just how much things have changed.Somehow Lexi went from a twenty-five-year-old working girl to a corporate big shot with a sleek new loft, a personal assistant, a carb-free diet, and a set of glamorous new friends. And who is this gorgeous husband—who also happens to be a multimillionaire? With her mind still stuck three years in reverse, Lexi greets this brave new world determined to be the person she…well, seems to be. That is, until an adorably disheveled architect drops the biggest bombshell of all.Suddenly Lexi is scrambling to catch her balance. Her new life, it turns out, comes complete with secrets, schemes, and intrigue. How on earth did all this happen? Will she ever remember? And what will happen when she does?With the same wicked humor and delicious charm that have won her millions of devoted fans, Sophie Kinsella, author of the #1 New York Times bestseller Shopaholic & Baby, returns with an irresistible new novel and a fresh new heroine who finds herself in a life-changing and utterly hilarious predicament… ...more"},
{"title": "If I Stay (If I Stay #1)", "product_description": "Librarian note: an alternate cover for this edition can be found here.Just listen, Adam says with a voice that sounds like shrapnel.I open my eyes wide now.I sit up as much as I can.And I listen.Stay, he says.Choices. Seventeen-year-old Mia is faced with some tough ones: Stay true to her first love—music—even if it means losing her boyfriend and leaving her family and frie Librarian note: an alternate cover for this edition can be found here.Just listen, Adam says with a voice that sounds like shrapnel.I open my eyes wide now.I sit up as much as I can.And I listen.Stay, he says.Choices. Seventeen-year-old Mia is faced with some tough ones: Stay true to her first love—music—even if it means losing her boyfriend and leaving her family and friends behind?Then one February morning Mia goes for a drive with her family, and in an instant, everything changes. Suddenly, all the choices are gone, except one. And it's the only one that matters.If I Stay is a heartachingly beautiful book about the power of love, the true meaning of family, and the choices we all make. ...more"},
{"title": "I Know Why the Caged Bird Sings (Maya Angelou's Autobiography #1)", "product_description": "Sent by their mother to live with their devout, self-sufficient grandmother in a small Southern town, Maya and her brother, Bailey, endure the ache of abandonment and the prejudice of the local powhitetrash. At eight years old and back at her mother’s side in St. Louis, Maya is attacked by a man many times her age—and has to live with the consequences for a lifetime. Yea Sent by their mother to live with their devout, self-sufficient grandmother in a small Southern town, Maya and her brother, Bailey, endure the ache of abandonment and the prejudice of the local powhitetrash. At eight years old and back at her mother’s side in St. Louis, Maya is attacked by a man many times her age—and has to live with the consequences for a lifetime. Years later, in San Francisco, Maya learns that love for herself, the kindness of others, her own strong spirit, and the ideas of great authors (I met and fell in love with William Shakespeare) will allow her to be free instead of imprisoned.Poetic and powerful, I Know Why the Caged Bird Sings will touch hearts and change minds for as long as people read. ...more"},
{"title": "The 5th Wave (The 5th Wave #1)", "product_description": "After the 1st wave, only darkness remains. After the 2nd, only the lucky escape. And after the 3rd, only the unlucky survive. After the 4th wave, only one rule applies: trust no one.Now, it's the dawn of the 5th wave, and on a lonely stretch of highway, Cassie runs from Them. The beings who only look human, who roam the countryside killing anyone they see. Who have scatter After the 1st wave, only darkness remains. After the 2nd, only the lucky escape. And after the 3rd, only the unlucky survive. After the 4th wave, only one rule applies: trust no one.Now, it's the dawn of the 5th wave, and on a lonely stretch of highway, Cassie runs from Them. The beings who only look human, who roam the countryside killing anyone they see. Who have scattered Earth's last survivors. To stay alone is to stay alive, Cassie believes, until she meets Evan Walker. Beguiling and mysterious, Evan Walker may be Cassie's only hope for rescuing her brother-or even saving herself. But Cassie must choose: between trust and despair, between defiance and surrender, between life and death. To give up or to get up. ...more"},
{"title": "The Fault in Our Stars", "product_description": "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten.Insightful, bold, irreverent, and raw, The Fault in Our Stars Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten.Insightful, bold, irreverent, and raw, The Fault in Our Stars is award-winning author John Green's most ambitious and heartbreaking work yet, brilliantly exploring the funny, thrilling, and tragic business of being alive and in love. ...more"},
{"title": "What If?: Serious Scientific Answers to Absurd Hypothetical Questions", "product_description": "Randall Munroe left NASA in 2005 to start up his hugely popular site XKCD 'a web comic of romance, sarcasm, math and language' which offers a witty take on the world of science and geeks. It now has 600,000 to a million page hits daily. Every now and then, Munroe would get emails asking him to arbitrate a science debate. 'My friend and I were arguing about what would happe Randall Munroe left NASA in 2005 to start up his hugely popular site XKCD 'a web comic of romance, sarcasm, math and language' which offers a witty take on the world of science and geeks. It now has 600,000 to a million page hits daily. Every now and then, Munroe would get emails asking him to arbitrate a science debate. 'My friend and I were arguing about what would happen if a bullet got struck by lightning, and we agreed that you should resolve it . . . ' He liked these questions so much that he started up What If. If your cells suddenly lost the power to divide, how long would you survive? How dangerous is it, really, to be in a swimming pool in a thunderstorm? If we hooked turbines to people exercising in gyms, how much power could we produce? What if everyone only had one soulmate?When (if ever) did the sun go down on the British empire? How fast can you hit a speed bump while driving and live?What would happen if the moon went away?In pursuit of answers, Munroe runs computer simulations, pores over stacks of declassified military research memos, solves differential equations, and consults with nuclear reactor operators. His responses are masterpieces of clarity and hilarity, studded with memorable cartoons and infographics. They often predict the complete annihilation of humankind, or at least a really big explosion. Far more than a book for geeks, WHAT IF: Serious Scientific Answers to Absurd Hypothetical Questions explains the laws of science in operation in a way that every intelligent reader will enjoy and feel much the smarter for having read. ...more"},
{"title": "Musicophilia: Tales of Music and the Brain", "product_description": "What goes on in human beings when they make or listen to music? What is it about music, what gives it such peculiar power over us, power delectable and beneficent for the most part, but also capable of uncontrollable and sometimes destructive force? Music has no concepts, it lacks images; it has no power of representation, it has no relation to the world. And yet it is evi What goes on in human beings when they make or listen to music? What is it about music, what gives it such peculiar power over us, power delectable and beneficent for the most part, but also capable of uncontrollable and sometimes destructive force? Music has no concepts, it lacks images; it has no power of representation, it has no relation to the world. And yet it is evident in all of us–we tap our feet, we keep time, hum, sing, conduct music, mirror the melodic contours and feelings of what we hear in our movements and expressions.In this book, Oliver Sacks explores the power music wields over us–a power that sometimes we control and at other times don’t. He explores, in his inimitable fashion, how it can provide access to otherwise unreachable emotional states, how it can revivify neurological avenues that have been frozen, evoke memories of earlier, lost events or states or bring those with neurological disorders back to a time when the world was much richer.This is a book that explores, like no other, the myriad dimensions of our experience of and with music. ...more"},
{"title": "Ship Leaves Harbor: Essays on Travel by a Recovering Journeyman", "product_description": "Still scarred from the theft of his belongings in Barcelona, the author returns stateside to reassess his dreams for future travel and struggling to regain his love of the journey. From short trips along the eastern U.S. seaboard, the author conquers his demons when he takes his family and returns to Paris, before heading to a new destination: Lisbon, Portugal."},
{"title": "The Fellowship of the Ring (The Lord of the Rings #1)", "product_description": "Frodo Baggins knew the Ringwraiths were searching for him—and the Ring of Power he bore that would enable Sauron to destroy all that was good in Middle-earth. Now it was up to Frodo and his faithful servant Sam to carry the Ring to where it could be destroyed—in the very center of Sauron's dark kingdom."},
{"title": "The Hobbit (Middle-Earth Universe)", "product_description": "In a hole in the ground there lived a hobbit. Not a nasty, dirty, wet hole, filled with the ends of worms and an oozy smell, nor yet a dry, bare, sandy hole with nothing in it to sit down on or to eat: it was a hobbit-hole, and that means comfort.Written for J.R.R. Tolkien’s own children, The Hobbit met with instant critical acclaim when it was first published in 1937. Now In a hole in the ground there lived a hobbit. Not a nasty, dirty, wet hole, filled with the ends of worms and an oozy smell, nor yet a dry, bare, sandy hole with nothing in it to sit down on or to eat: it was a hobbit-hole, and that means comfort.Written for J.R.R. Tolkien’s own children, The Hobbit met with instant critical acclaim when it was first published in 1937. Now recognized as a timeless classic, this introduction to the hobbit Bilbo Baggins, the wizard Gandalf, Gollum, and the spectacular world of Middle-earth recounts of the adventures of a reluctant hero, a powerful and dangerous ring, and the cruel dragon Smaug the Magnificent. The text in this 372-page paperback edition is based on that first published in Great Britain by Collins Modern Classics (1998), and includes a note on the text by Douglas A. Anderson (2001). Unforgettable! ...more"},
{"title": "The Makings of a Fatherless Child", "product_description": "Chandler Alexander's The Makings of a Fatherless Child is a dark and riveting tale of a young boy, Amel River, growing of age in the Mississippi Delta all while trying to survive a broken home, poverty, fatherlessness, and a voice in his head that won't go away. With the wisdom of a drunken stranger King Lee, the unspoken love of his best friend Sea'Sea, and the innocent e Chandler Alexander's The Makings of a Fatherless Child is a dark and riveting tale of a young boy, Amel River, growing of age in the Mississippi Delta all while trying to survive a broken home, poverty, fatherlessness, and a voice in his head that won't go away. With the wisdom of a drunken stranger King Lee, the unspoken love of his best friend Sea'Sea, and the innocent eyes of his two-year-old nephew Javion, Amel embarks on an unknown journey of truth, understanding, and forgiveness, hoping that his journey will lead him to experience his ultimate definition of freedom, a life worth living. ...more"},
{"title": "The Perks of Being a Wallflower", "product_description": "Charlie is a freshman.And while he's not the biggest geek in the school, he is by no means popular. Shy, introspective, intelligent beyond his years yet socially awkward, he is a wallflower, caught between trying to live his life and trying to run from it.Charlie is attempting to navigate his way through uncharted territory: the world of first dates and mix tapes, family d Charlie is a freshman.And while he's not the biggest geek in the school, he is by no means popular. Shy, introspective, intelligent beyond his years yet socially awkward, he is a wallflower, caught between trying to live his life and trying to run from it.Charlie is attempting to navigate his way through uncharted territory: the world of first dates and mix tapes, family dramas and new friends; the world of sex, drugs, and The Rocky Horror Picture Show, when all one requires is that perfect song on that perfect drive to feel infinite. But he can't stay on the sideline forever. Standing on the fringes of life offers a unique perspective. But there comes a time to see what it looks like from the dance floor.The Perks of Being a Wallflower is a deeply affecting coming-of-age story that will spirit you back to those wild and poignant roller-coaster days known as growing up. ...more"},
{"title": "The Sound Of Love", "product_description": "Born and raised on her family farm in rural East Tennessee, Danielle Adams always dreamed of moving to Nashville—known in her family as the “big city”. She had the voice of an angel and her skills on the piano put her on par with some of the best pianists in the world. On her twenty-first birthday, Danielle’s parents bought her a one-way ticket to “the big city” and gave h Born and raised on her family farm in rural East Tennessee, Danielle Adams always dreamed of moving to Nashville—known in her family as the “big city”. She had the voice of an angel and her skills on the piano put her on par with some of the best pianists in the world. On her twenty-first birthday, Danielle’s parents bought her a one-way ticket to “the big city” and gave her enough money to live for a year. Her parents—along with everyone at their church and all through the town—knew of her talents and felt it was time she shared her GOD-given gifts with the world.Danielle’s life in Nashville starts off rocky, but eventually she finds her way. Before long, a music producer notices her talents and signs her to a record deal. After performing in a few shows, she instantly becomes the new darling of Nashville. One day while performing, Danielle notices that her hearing seems to be going in and out. After this happens a couple more times, Danielle decides it’s time for her to go see a doctor. To her shock, she learns that she has a rare genetic disorder that will cause her to eventually become deaf. Her doctor gives her a referral to someone who can teach her sign language and other useful devices that will make life easier once her hearing is fully gone. Danielle—devastated to say the least—falls into a deep depression and begins questioning GOD’s plan for her life.Eventually, Danielle goes to meet with the doctor’s referral, Walker Davenport; who turns out to be an exceptionally handsome and kind man—who also happens to be a musician himself. He helps her prepare for life as a deaf person—starting with making her a hearing “bucket list”. Walker even shows her ways she can still have music in her life even if she is unable to hear. Over time, Daniele and Walker become close and eventually fall in love. Their young love blossoms, and marriage seems to be right on the horizon. That is, until the day that they had been planning for finally arrives—when Danielle’s hearing is completely gone. Unable to handle her new reality, Danielle rebuffs Walker, and shuts out the rest of the world—even her close nit family. Walker then finds himself trying to prove to her that the sound of love can still be heard even when your world is silent. ...more"},
{"title": "Life of Pi", "product_description": "Life of Pi is a fantasy adventure novel by Yann Martel published in 2001. The protagonist, Piscine Molitor Pi Patel, a Tamil boy from Pondicherry, explores issues of spirituality and practicality from an early age. He survives 227 days after a shipwreck while stranded on a boat in the Pacific Ocean with a Bengal tiger named Richard Parker."},
{"title": "Steal Like an Artist: 10 Things Nobody Told You About Being Creative", "product_description": "You don’t need to be a genius, you just need to be yourself. That’s the message from Austin Kleon, a young writer and artist who knows that creativity is everywhere, creativity is for everyone. A manifesto for the digital age, Steal Like an Artist is a guide whose positive message, graphic look and illustrations, exercises, and examples will put readers directly in touch w You don’t need to be a genius, you just need to be yourself. That’s the message from Austin Kleon, a young writer and artist who knows that creativity is everywhere, creativity is for everyone. A manifesto for the digital age, Steal Like an Artist is a guide whose positive message, graphic look and illustrations, exercises, and examples will put readers directly in touch with their artistic side. ...more"},
{"title": "The Lover's Dictionary", "product_description": "basis, n.There has to be a moment at the beginning when you wonder whether you're in love with the person or in love with the feeling of love itself.If the moment doesn't pass, that's it―you're done. And if the moment does pass, it never goes that far. It stands in the distance, ready for whenever you want it back. Sometimes it's even there when you thought you were search basis, n.There has to be a moment at the beginning when you wonder whether you're in love with the person or in love with the feeling of love itself.If the moment doesn't pass, that's it―you're done. And if the moment does pass, it never goes that far. It stands in the distance, ready for whenever you want it back. Sometimes it's even there when you thought you were searching for something else, like an escape route, or your lover's face.How does one talk about love? Do we even have the right words to describe something that can be both utterly mundane and completely transcendent, pulling us out of our everyday lives and making us feel a part of something greater than ourselves? Taking a unique approach to this problem, the nameless narrator of David Levithan's The Lover's Dictionary has constructed the story of his relationship as a dictionary. Through these short entries, he provides an intimate window into the great events and quotidian trifles of being within a couple, giving us an indelible and deeply moving portrait of love in our time. ...more"},
{"title": "The 7 Habits of Highly Effective People: Powerful Lessons in Personal Change", "product_description": "In The 7 Habits of Highly Effective People, author Stephen R. Covey presents a holistic, integrated, principle-centered approach for solving personal and professional problems. With penetrating insights and pointed anecdotes, Covey reveals a step-by-step pathway for living with fairness, integrity, service, and human dignity -- principles that give us the security to adapt In The 7 Habits of Highly Effective People, author Stephen R. Covey presents a holistic, integrated, principle-centered approach for solving personal and professional problems. With penetrating insights and pointed anecdotes, Covey reveals a step-by-step pathway for living with fairness, integrity, service, and human dignity -- principles that give us the security to adapt to change and the wisdom and power to take advantage of the opportunities that change creates. ...more"},
{"title": "The Goldfinch", "product_description": "It begins with a boy. Theo Decker, a thirteen-year-old New Yorker, miraculously survives an accident that kills his mother. Abandoned by his father, Theo is taken in by the family of a wealthy friend. Bewildered by his strange new home on Park Avenue, disturbed by schoolmates who don't know how to talk to him, and tormented above all by his unbearable longing for his mothe It begins with a boy. Theo Decker, a thirteen-year-old New Yorker, miraculously survives an accident that kills his mother. Abandoned by his father, Theo is taken in by the family of a wealthy friend. Bewildered by his strange new home on Park Avenue, disturbed by schoolmates who don't know how to talk to him, and tormented above all by his unbearable longing for his mother, he clings to one thing that reminds him of her: a small, mysteriously captivating painting that ultimately draws Theo into the underworld of art.As an adult, Theo moves silkily between the drawing rooms of the rich and the dusty labyrinth of an antiques store where he works. He is alienated and in love-and at the center of a narrowing, ever more dangerous circle.The Goldfinch combines vivid characters, mesmerizing language, and suspense, while plumbing with a philosopher's calm the deepest mysteries of love, identity, and art. It is an old-fashioned story of loss and obsession, survival and self-invention, and the ruthless machinations of fate. ...more"},
{"title": "The Good Girl", "product_description": "I've been following her for the past few days. I know where she buys her groceries, where she works. I don't know the color of her eyes or what they look like when she's scared. But I will. One night, Mia Dennett enters a bar to meet her on-again, off-again boyfriend. But when he doesn't show, she unwisely leaves with an enigmatic stranger. At first Colin Thatcher seems I've been following her for the past few days. I know where she buys her groceries, where she works. I don't know the color of her eyes or what they look like when she's scared. But I will. One night, Mia Dennett enters a bar to meet her on-again, off-again boyfriend. But when he doesn't show, she unwisely leaves with an enigmatic stranger. At first Colin Thatcher seems like a safe one-night stand. But following Colin home will turn out to be the worst mistake of Mia's life. When Colin decides to hide Mia in a secluded cabin in rural Minnesota instead of delivering her to his employers, Mia's mother, Eve, and detective Gabe Hoffman will stop at nothing to find them. But no one could have predicted the emotional entanglements that eventually cause this family's world to shatter. An addictively suspenseful and tautly written thriller, The Good Girl is a propulsive debut that reveals how even in the perfect family, nothing is as it seems. ...more"},
{"title": "The Maze Runner (The Maze Runner #1)", "product_description": "If you ain’t scared, you ain’t human.When Thomas wakes up in the lift, the only thing he can remember is his name. He’s surrounded by strangers—boys whose memories are also gone.Nice to meet ya, shank. Welcome to the Glade.Outside the towering stone walls that surround the Glade is a limitless, ever-changing maze. It’s the only way out—and no one’s ever made it through ali If you ain’t scared, you ain’t human.When Thomas wakes up in the lift, the only thing he can remember is his name. He’s surrounded by strangers—boys whose memories are also gone.Nice to meet ya, shank. Welcome to the Glade.Outside the towering stone walls that surround the Glade is a limitless, ever-changing maze. It’s the only way out—and no one’s ever made it through alive.Everything is going to change.Then a girl arrives. The first girl ever. And the message she delivers is terrifying.Remember. Survive. Run. ...more"},
{"title": "The Paris Wife", "product_description": "A deeply evocative story of ambition and betrayal, The Paris Wife captures a remarkable period of time and a love affair between two unforgettable people: Ernest Hemingway and his wife Hadley.Chicago, 1920: Hadley Richardson is a quiet twenty-eight-year-old who has all but given up on love and happiness—until she meets Ernest Hemingway and her life changes forever. Followi A deeply evocative story of ambition and betrayal, The Paris Wife captures a remarkable period of time and a love affair between two unforgettable people: Ernest Hemingway and his wife Hadley.Chicago, 1920: Hadley Richardson is a quiet twenty-eight-year-old who has all but given up on love and happiness—until she meets Ernest Hemingway and her life changes forever. Following a whirlwind courtship and wedding, the pair set sail for Paris, where they become the golden couple in a lively and volatile group—the fabled “Lost Generation”—that includes Gertrude Stein, Ezra Pound, and F. Scott and Zelda Fitzgerald. Though deeply in love, the Hemingways are ill-prepared for the hard-drinking and fast-living life of Jazz Age Paris, which hardly values traditional notions of family and monogamy. Surrounded by beautiful women and competing egos, Ernest struggles to find the voice that will earn him a place in history, pouring all the richness and intensity of his life with Hadley and their circle of friends into the novel that will become The Sun Also Rises. Hadley, meanwhile, strives to hold on to her sense of self as the demands of life with Ernest grow costly and her roles as wife, friend, and muse become more challenging. Despite their extraordinary bond, they eventually find themselves facing the ultimate crisis of their marriage—a deception that will lead to the unraveling of everything they’ve fought so hard for. A heartbreaking portrayal of love and torn loyalty, The Paris Wife is all the more poignant because we know that, in the end, Hemingway wrote that he would rather have died than fallen in love with anyone but Hadley. ...more"},
{"title": "Twilight (Twilight #1)", "product_description": "About three things I was absolutely positive.First, Edward was a vampire.Second, there was a part of him—and I didn't know how dominant that part might be—that thirsted for my blood.And third, I was unconditionally and irrevocably in love with him.In the first book of the Twilight Saga, internationally bestselling author Stephenie Meyer introduces Bella Swan and Edward Cul About three things I was absolutely positive.First, Edward was a vampire.Second, there was a part of him—and I didn't know how dominant that part might be—that thirsted for my blood.And third, I was unconditionally and irrevocably in love with him.In the first book of the Twilight Saga, internationally bestselling author Stephenie Meyer introduces Bella Swan and Edward Cullen, a pair of star-crossed lovers whose forbidden relationship ripens against the backdrop of small-town suspicion and a mysterious coven of vampires. This is a love story with bite. ...more"},
{"title": "Where'd You Go, Bernadette", "product_description": "Bernadette Fox is notorious. To her Microsoft-guru husband, she's a fearlessly opinionated partner; to fellow private-school mothers in Seattle, she's a disgrace; to design mavens, she's a revolutionary architect, and to 15-year-old Bee, she is a best friend and, simply, Mom.Then Bernadette disappears. It began when Bee aced her report card and claimed her promised reward: Bernadette Fox is notorious. To her Microsoft-guru husband, she's a fearlessly opinionated partner; to fellow private-school mothers in Seattle, she's a disgrace; to design mavens, she's a revolutionary architect, and to 15-year-old Bee, she is a best friend and, simply, Mom.Then Bernadette disappears. It began when Bee aced her report card and claimed her promised reward: a family trip to Antarctica. But Bernadette's intensifying allergy to Seattle—and people in general—has made her so agoraphobic that a virtual assistant in India now runs her most basic errands. A trip to the end of the earth is problematic.To find her mother, Bee compiles email messages, official documents, secret correspondence—creating a compulsively readable and touching novel about misplaced genius and a mother and daughter's role in an absurd world. ...more"},
{"title": "Wild: From Lost to Found on the Pacific Crest Trail", "product_description": "#1 NATIONAL BESTSELLER, SOON TO BE A MAJOR MOTION PICTURE.At twenty-two, Cheryl Strayed thought she had lost everything. In the wake of her mother’s death, her family scattered and her own marriage was soon destroyed. Four years later, with nothing more to lose, she made the most impulsive decision of her life. With no experience or training, driven only by blind will, she #1 NATIONAL BESTSELLER, SOON TO BE A MAJOR MOTION PICTURE.At twenty-two, Cheryl Strayed thought she had lost everything. In the wake of her mother’s death, her family scattered and her own marriage was soon destroyed. Four years later, with nothing more to lose, she made the most impulsive decision of her life. With no experience or training, driven only by blind will, she would hike more than a thousand miles of the Pacific Crest Trail from the Mojave Desert through California and Oregon to Washington State — and she would do it alone.Told with suspense and style, sparkling with warmth and humor, Wild powerfully captures the terrors and pleasures of one young woman forging ahead against all odds on a journey that maddened, strengthened, and ultimately healed her. ...more"},
{"title": "World War Z: An Oral History of the Zombie War", "product_description": "The Zombie War came unthinkably close to eradicating humanity. Max Brooks, driven by the urgency of preserving the acid-etched first-hand experiences of the survivors from those apocalyptic years, traveled across the United States of America and throughout the world, from decimated cities that once teemed with upwards of thirty million souls to the most remote and inhospit The Zombie War came unthinkably close to eradicating humanity. Max Brooks, driven by the urgency of preserving the acid-etched first-hand experiences of the survivors from those apocalyptic years, traveled across the United States of America and throughout the world, from decimated cities that once teemed with upwards of thirty million souls to the most remote and inhospitable areas of the planet. He recorded the testimony of men, women, and sometimes children who came face-to-face with the living, or at least the undead, hell of that dreadful time. World War Z is the result. Never before have we had access to a document that so powerfully conveys the depth of fear and horror, and also the ineradicable spirit of resistance, that gripped human society through the plague years. Ranging from the now infamous village of New Dachang in the United Federation of China, where the epidemiological trail began with the twelve-year-old Patient Zero, to the unnamed northern forests where untold numbers sought a terrible and temporary refuge in the cold, to the United States of Southern Africa, where the Redeker Plan provided hope for humanity at an unspeakable price, to the west-of-the-Rockies redoubt where the North American tide finally started to turn, this invaluable chronicle reflects the full scope and duration of the Zombie War. Most of all, the book captures with haunting immediacy the human dimension of this epochal event. Facing the often raw and vivid nature of these personal accounts requires a degree of courage on the part of the reader, but the effort is invaluable because, as Mr. Brooks says in his introduction, By excluding the human factor, aren't we risking the kind of personal detachment from history that may, heaven forbid, lead us one day to repeat it? And in the end, isn't the human factor the only true difference between us and the enemy we now refer to as 'the living dead'? Note: Some of the numerical and factual material contained in this edition was previously published under the auspices of the United Nations Postwar Commission. Eyewitness reports from the first truly global war> ...more"},
{"title": "Zero History (Blue Ant #3)", "product_description": "The iconic visionary returns with his first new novel since the New York Times bestseller Spook Country. Whatever you do, because you are an artist, will bring you to the next thing of your own... When she sang for The Curfew, Hollis Henry's face was known worldwide. She still runs into people who remember the poster. Unfortunately, in the post-crash economy, cult memorab The iconic visionary returns with his first new novel since the New York Times bestseller Spook Country. Whatever you do, because you are an artist, will bring you to the next thing of your own... When she sang for The Curfew, Hollis Henry's face was known worldwide. She still runs into people who remember the poster. Unfortunately, in the post-crash economy, cult memorabilia doesn't pay the rent, and right now she's a journalist in need of a job. The last person she wants to work for is Hubertus Bigend, twisted genius of global marketing; but there's no way to tell an entity like Bigend that you want nothing more to do with him. That simply brings you more firmly to his attention. Milgrim is clean, drug-free for the first time in a decade. It took eight months in a clinic in Basel. Fifteen complete changes of his blood. Bigend paid for all that. Milgrim's idiomatic Russian is superb, and he notices things. Meanwhile no one notices Milgrim. That makes him worth every penny, though it cost Bigend more than his cartel-grade custom-armored truck. The culture of the military has trickled down to the street- Bigend knows that, and he'll find a way to take a cut. What surprises him though is that someone else seems to be on top of that situation in a way that Bigend associates only with himself. Bigend loves staring into the abyss of the global market; he's just not used to it staring back.Watch a Video ...more"},
{"title": "Alight (The Generations Trilogy #2)", "product_description": "Alight is the second installment in the YA sci-fi adventure trilogy by New York Times bestselling author Scott Sigler, hot on the heels of Alive.Alight reveals to readers the further adventures of Em, Spingate, O’Malley, Bishop, and the other young heroes introduced in Alive. In Alive, Em fought to assert herself as leader and her friends tried to comprehend their own myst Alight is the second installment in the YA sci-fi adventure trilogy by New York Times bestselling author Scott Sigler, hot on the heels of Alive.Alight reveals to readers the further adventures of Em, Spingate, O’Malley, Bishop, and the other young heroes introduced in Alive. In Alive, Em fought to assert herself as leader and her friends tried to comprehend their own mysterious identity; now she must wrestle not with the challenge of winning power but the grave responsibility of having assumed it, and she and her friends must contend with a grim fact: the revelation of their identity is not an answer but another question—and one with terrifying implications. ...more"},
{"title": "The Shining (The Shining #1)", "product_description": "Danny was only five years old but in the words of old Mr Halloran he was a 'shiner', aglow with psychic voltage. When his father became caretaker of the Overlook Hotel his visions grew frighteningly out of control. As winter closed in and blizzards cut them off, the hotel seemed to develop a life of its own. It was meant to be empty, but who was the lady in Room 217, and w Danny was only five years old but in the words of old Mr Halloran he was a 'shiner', aglow with psychic voltage. When his father became caretaker of the Overlook Hotel his visions grew frighteningly out of control. As winter closed in and blizzards cut them off, the hotel seemed to develop a life of its own. It was meant to be empty, but who was the lady in Room 217, and who were the masked guests going up and down in the elevator? And why did the hedges shaped like animals seem so alive? Somewhere, somehow there was an evil force in the hotel - and that too had begun to shine... ...more"},
{"title": "Confessions of a Shopaholic (Shopaholic #1)", "product_description": "MEET BECKY BLOOMWOOD, AN IRRESISTIBLE HEROINE WITH A BIG HEART, BIG DREAMS --- AND JUST ONE LITTLE WEAKNESS ...Becky Bloomwood has what most twenty-five-year-olds only dream of: a flat in London's trendiest neighborhood, a troupe of glamorous socialite friends, and a closet brimming with the season's must-haves. The only trouble is, she can't actually afford it --- not any MEET BECKY BLOOMWOOD, AN IRRESISTIBLE HEROINE WITH A BIG HEART, BIG DREAMS --- AND JUST ONE LITTLE WEAKNESS ...Becky Bloomwood has what most twenty-five-year-olds only dream of: a flat in London's trendiest neighborhood, a troupe of glamorous socialite friends, and a closet brimming with the season's must-haves. The only trouble is, she can't actually afford it --- not any of it. Her job writing at Successful Saving magazine not only bores her to tears, it doesn't pay much at all. Still, how can she resist that perfect pair of shoes? Or the divine silk blouse in the window of that ultra-trendy boutique? But lately Becky's been chased by dismal letters from Visa and the Endwich Bank --- letters with large red sums she can't bear to read --- and they're getting ever harder to ignore. She tries cutting back; she even tries making more money. But none of her efforts succeeds. Her only consolation is to buy herself something ... just a little something ...Finally, a story arises that Becky actually cares about, and her front-page article catalyzes a chain of events that will transform her life --- and the lives of those around her --- forever. ...more"},
{"title": "Harry Potter and the Sorcerer's Stone (Harry Potter #1)", "product_description": "Harry Potter thinks he is an ordinary boy. He lives with his Uncle Vernon, Aunt Petunia and cousin Dudley, who are mean to him and make him sleep in a cupboard under the stairs. (Dudley, however, has two bedrooms, one to sleep in and one for all his toys and games.) Then Harry starts receiving mysterious letters and his life is changed forever. He is whisked away by a beet Harry Potter thinks he is an ordinary boy. He lives with his Uncle Vernon, Aunt Petunia and cousin Dudley, who are mean to him and make him sleep in a cupboard under the stairs. (Dudley, however, has two bedrooms, one to sleep in and one for all his toys and games.) Then Harry starts receiving mysterious letters and his life is changed forever. He is whisked away by a beetle-eyed giant of a man and enrolled at Hogwarts School of Witchcraft and Wizardry. The reason: Harry Potter is a wizard! The first book in the Harry Potter series makes the perfect introduction to the world of Hogwarts. ...more"},
{"title": "Mockingjay (The Hunger Games #3)", "product_description": "My name is Katniss Everdeen.Why am I not dead?I should be dead.Katniss Everdeen, girl on fire, has survived, even though her home has been destroyed. Gale has escaped. Katniss's family is safe. Peeta has been captured by the Capitol. District 13 really does exist. There are rebels. There are new leaders. A revolution is unfolding.It is by design that Katniss was rescued fr My name is Katniss Everdeen.Why am I not dead?I should be dead.Katniss Everdeen, girl on fire, has survived, even though her home has been destroyed. Gale has escaped. Katniss's family is safe. Peeta has been captured by the Capitol. District 13 really does exist. There are rebels. There are new leaders. A revolution is unfolding.It is by design that Katniss was rescued from the arena in the cruel and haunting Quarter Quell, and it is by design that she has long been part of the revolution without knowing it. District 13 has come out of the shadows and is plotting to overthrow the Capitol. Everyone, it seems, has had a hand in the carefully laid plans--except Katniss.The success of the rebellion hinges on Katniss's willingness to be a pawn, to accept responsibility for countless lives, and to change the course of the future of Panem. To do this, she must put aside her feelings of anger and distrust. She must become the rebels' Mockingjay--no matter what the personal cost. ...more"},
{"title": "Vogue Colors A to Z: A Fashion Coloring Book", "product_description": "In this first-ever coloring book from American Vogue, you are invited into a world of fashion fantasy. Twenty-six archival magazine covers from 1912 to 1932, by ten celebrated illustrators living here and abroad, take you back to a more playful and whimsical moment of boas, bows, hats and headpieces, fans, pearls and gloves, and even exotic animals. Coloring book fans of a In this first-ever coloring book from American Vogue, you are invited into a world of fashion fantasy. Twenty-six archival magazine covers from 1912 to 1932, by ten celebrated illustrators living here and abroad, take you back to a more playful and whimsical moment of boas, bows, hats and headpieces, fans, pearls and gloves, and even exotic animals. Coloring book fans of all ages can try their hand at the Art Deco patterns and letters from A to Z and the lively drawings of women dressed for the task at hand, whether it is driving their own car, pruning morning glories in the garden, feeding a dragon, steering a gondola, sitting on a crescent moon, perched on a peacock or riding a zebra—side-saddle, of course. This is the Vogue woman as liberated, stylish, and always dressed for adventure. ...more"},
{"title": "Outlander (Outlander #1)", "product_description": "The year is 1945. Claire Randall, a former combat nurse, is just back from the war and reunited with her husband on a second honeymoon when she walks through a standing stone in one of the ancient circles that dot the British Isles. Suddenly she is a Sassenach—an “outlander”—in a Scotland torn by war and raiding border clans in the year of Our Lord...1743.Hurled back in ti The year is 1945. Claire Randall, a former combat nurse, is just back from the war and reunited with her husband on a second honeymoon when she walks through a standing stone in one of the ancient circles that dot the British Isles. Suddenly she is a Sassenach—an “outlander”—in a Scotland torn by war and raiding border clans in the year of Our Lord...1743.Hurled back in time by forces she cannot understand, Claire is catapulted into the intrigues of lairds and spies that may threaten her life, and shatter her heart. For here James Fraser, a gallant young Scots warrior, shows her a love so absolute that Claire becomes a woman torn between fidelity and desire—and between two vastly different men in two irreconcilable lives. ...more"},
{"title": "The Hunger Games (The Hunger Games #1)", "product_description": "Winning will make you famous. Losing means certain death.The nation of Panem, formed from a post-apocalyptic North America, is a country that consists of a wealthy Capitol region surrounded by 12 poorer districts. Early in its history, a rebellion led by a 13th district against the Capitol resulted in its destruction and the creation of an annual televised event known as t Winning will make you famous. Losing means certain death.The nation of Panem, formed from a post-apocalyptic North America, is a country that consists of a wealthy Capitol region surrounded by 12 poorer districts. Early in its history, a rebellion led by a 13th district against the Capitol resulted in its destruction and the creation of an annual televised event known as the Hunger Games. In punishment, and as a reminder of the power and grace of the Capitol, each district must yield one boy and one girl between the ages of 12 and 18 through a lottery system to participate in the games. The 'tributes' are chosen during the annual Reaping and are forced to fight to the death, leaving only one survivor to claim victory.When 16-year-old Katniss's young sister, Prim, is selected as District 12's female representative, Katniss volunteers to take her place. She and her male counterpart Peeta, are pitted against bigger, stronger representatives, some of whom have trained for this their whole lives. , she sees it as a death sentence. But Katniss has been close to death before. For her, survival is second nature. ...more"},
{"title": "Fool Me Once", "product_description": "#1 New York Times bestseller Harlan Coben delivers his next impossible-to-put-down thriller. In the course of eight consecutive #1 New York Times bestsellers, millions of readers have discovered Harlan Coben’s page-turning thrillers, filled with his trademark edge-of-your-seat suspense and gut-wrenching emotion. In Fool Me Once, Coben once again outdoes himself. Former #1 New York Times bestseller Harlan Coben delivers his next impossible-to-put-down thriller.   In the course of eight consecutive #1 New York Times bestsellers, millions of readers have discovered Harlan Coben’s page-turning thrillers, filled with his trademark edge-of-your-seat suspense and gut-wrenching emotion. In Fool Me Once, Coben once again outdoes himself.   Former special ops pilot Maya, home from the war, sees an unthinkable image captured by her nanny cam while she is at work: her two-year-old daughter playing with Maya’s husband, Joe—who had been brutally murdered two weeks earlier. The provocative question at the heart of the mystery: Can you believe everything you see with your own eyes, even when you desperately want to? To find the answer, Maya must finally come to terms with deep secrets and deceit in her own past before she can face the unbelievable truth about her husband—and herself. ...more"},
{"title": "Dracula", "product_description": "A rich selection of background and source materials is provided in three areas: Contexts includes probable inspirations for Dracula in the earlier works of James Malcolm Rymer and Emily Gerard. Also included are a discussion of Stoker's working notes for the novel and Dracula's Guest, the original opening chapter to Dracula. Reviews and Reactions reprints five early revi A rich selection of background and source materials is provided in three areas: Contexts includes probable inspirations for Dracula in the earlier works of James Malcolm Rymer and Emily Gerard. Also included are a discussion of Stoker's working notes for the novel and Dracula's Guest, the original opening chapter to Dracula. Reviews and Reactions reprints five early reviews of the novel. Dramatic and Film Variations focuses on theater and film adaptations of Dracula, two indications of the novel's unwavering appeal. David J. Skal, Gregory A. Waller, and Nina Auerbach offer their varied perspectives. Checklists of both dramatic and film adaptations are included.Criticism collects seven theoretical interpretations of Dracula by Phyllis A. Roth, Carol A. Senf, Franco Moretti, Christopher Craft, Bram Dijsktra, Stephen D. Arata, and Talia Schaffer.A Chronology and a Selected Bibliography are included. ...more"},
{"title": "Eclipse (Twilight #3)", "product_description": "BELLA?Edward's soft voice came from behind me. I turned to see him spring lightly up the porch steps, his hair windblown from running. He pulled me into his arms at once, just like he had in the parking lot, and kissed me again.This kiss frightened me. There was too much tension, too strong an edge to the way his lips crushed mine - like he was afraid we had only so much BELLA?Edward's soft voice came from behind me. I turned to see him spring lightly up the porch steps, his hair windblown from running. He pulled me into his arms at once, just like he had in the parking lot, and kissed me again.This kiss frightened me. There was too much tension, too strong an edge to the way his lips crushed mine - like he was afraid we had only so much time left to us.--As Seattle is ravaged by a string of mysterious killings and a malicious vampire continues her quest for revenge, Bella once again finds herself surrounded by danger. In the midst of it all, she is forced to choose between her love for Edward and her friendship with Jacob - knowing that her decision has the potential to ignite the ageless struggle between vampire and werewolf. With her graduation quickly approaching, Bella has one more decision to make: life or death. But which is which?Readers captivated by Twilight and New Moon will eagerly devour Eclipse, the much-anticipated third book in Stephenie Meyer's riveting vampire love saga. ...more"},
{"title": "Blue Lily, Lily Blue (The Raven Cycle #3)", "product_description": "There is danger in dreaming. But there is even more danger in waking up. Blue Sargent has found things. For the first time in her life, she has friends she can trust, a group to which she can belong. The Raven Boys have taken her in as one of their own. Their problems have become hers, and her problems have become theirs. The trick with found things though, is how easily t There is danger in dreaming. But there is even more danger in waking up. Blue Sargent has found things. For the first time in her life, she has friends she can trust, a group to which she can belong. The Raven Boys have taken her in as one of their own. Their problems have become hers, and her problems have become theirs. The trick with found things though, is how easily they can be lost. Friends can betray. Mothers can disappear. Visions can mislead. Certainties can unravel. ...more"},
{"title": "Drama", "product_description": "PLACES, EVERYONE!Callie loves theater. And while she would totally try out for her middle school's production of Moon Over Mississippi, she can't really sing. Instead she's the set designer for the drama department stage crew, and this year she's determined to create a set worthy of Broadway on a middle-school budget. But how can she, when she doesn't know much about carpe PLACES, EVERYONE!Callie loves theater. And while she would totally try out for her middle school's production of Moon Over Mississippi, she can't really sing. Instead she's the set designer for the drama department stage crew, and this year she's determined to create a set worthy of Broadway on a middle-school budget. But how can she, when she doesn't know much about carpentry, ticket sales are down, and the crew members are having trouble working together? Not to mention the onstage AND offstage drama that occurs once the actors are chosen. And when two cute brothers enter the picture, things get even crazier! ...more"},
{"title": "David and Goliath: Underdogs, Misfits, and the Art of Battling Giants", "product_description": "In his #1 bestselling books The Tipping Point, Blink, and Outliers, Malcolm Gladwell has explored the ways we understand and change our world. Now he looks at the complex and surprising ways the weak can defeat the strong, the small can match up against the giant, and how our goals (often culturally determined) can make a huge difference in our ultimate sense of success. D In his #1 bestselling books The Tipping Point, Blink, and Outliers, Malcolm Gladwell has explored the ways we understand and change our world. Now he looks at the complex and surprising ways the weak can defeat the strong, the small can match up against the giant, and how our goals (often culturally determined) can make a huge difference in our ultimate sense of success. Drawing upon examples from the world of business, sports, culture, cutting-edge psychology, and an array of unforgettable characters around the world, David and Goliath is in many ways the most practical and provocative book Malcolm Gladwell has ever written. ...more"},
{"title": "Dead Wake: The Last Crossing of the Lusitania", "product_description": "#1 New York Times BestsellerFrom thebestselling author and master of narrative nonfiction comes the enthralling story of the sinking of the LusitaniaOn May 1, 1915, with WWI entering its tenth month, a luxury ocean liner as richly appointed as an English country house sailed out of New York, bound for Liverpool, carrying a record number of children and infants. The passeng #1 New York Times BestsellerFrom the bestselling author and master of narrative nonfiction comes the enthralling story of the sinking of the LusitaniaOn May 1, 1915, with WWI entering its tenth month, a luxury ocean liner as richly appointed as an English country house sailed out of New York, bound for Liverpool, carrying a record number of children and infants. The passengers were surprisingly at ease, even though Germany had declared the seas around Britain to be a war zone. For months, German U-boats had brought terror to the North Atlantic. But the Lusitania was one of the era’s great transatlantic “Greyhounds”—the fastest liner then in service—and her captain, William Thomas Turner, placed tremendous faith in the gentlemanly strictures of warfare that for a century had kept civilian ships safe from attack. Germany, however, was determined to change the rules of the game, and Walther Schwieger, the captain of Unterseeboot-20, was happy to oblige. Meanwhile, an ultra-secret British intelligence unit tracked Schwieger’s U-boat, but told no one. As U-20 and the Lusitania made their way toward Liverpool, an array of forces both grand and achingly small—hubris, a chance fog, a closely guarded secret, and more—all converged to produce one of the great disasters of history. It is a story that many of us think we know but don’t, and Erik Larson tells it thrillingly, switching between hunter and hunted while painting a larger portrait of America at the height of the Progressive Era. Full of glamour and suspense, Dead Wake brings to life a cast of evocative characters, from famed Boston bookseller Charles Lauriat to pioneering female architect Theodate Pope to President Woodrow Wilson, a man lost to grief, dreading the widening war but also captivated by the prospect of new love.  Gripping and important, Dead Wake captures the sheer drama and emotional power of a disaster whose intimate details and true meaning have long been obscured by history. ...more"},
{"title": "Gone Girl", "product_description": "On a warm summer morning in North Carthage, Missouri, it is Nick and Amy Dunne’s fifth wedding anniversary. Presents are being wrapped and reservations are being made when Nick’s clever and beautiful wife disappears. Husband-of-the-Year Nick isn’t doing himself any favors with cringe-worthy daydreams about the slope and shape of his wife’s head, but passages from Amy's dia On a warm summer morning in North Carthage, Missouri, it is Nick and Amy Dunne’s fifth wedding anniversary. Presents are being wrapped and reservations are being made when Nick’s clever and beautiful wife disappears. Husband-of-the-Year Nick isn’t doing himself any favors with cringe-worthy daydreams about the slope and shape of his wife’s head, but passages from Amy's diary reveal the alpha-girl perfectionist could have put anyone dangerously on edge. Under mounting pressure from the police and the media—as well as Amy’s fiercely doting parents—the town golden boy parades an endless series of lies, deceits, and inappropriate behavior. Nick is oddly evasive, and he’s definitely bitter—but is he really a killer?  ...more"},
{"title": "Is Everyone Hanging Out Without Me? (And Other Concerns)", "product_description": "Mindy Kaling has lived many lives: the obedient child of immigrant professionals, a timid chubster afraid of her own bike, a Ben Affleck–impersonating Off-Broadway performer and playwright, and, finally, a comedy writer and actress prone to starting fights with her friends and coworkers with the sentence “Can I just say one last thing about this, and then I swear I’ll shut Mindy Kaling has lived many lives: the obedient child of immigrant professionals, a timid chubster afraid of her own bike, a Ben Affleck–impersonating Off-Broadway performer and playwright, and, finally, a comedy writer and actress prone to starting fights with her friends and coworkers with the sentence “Can I just say one last thing about this, and then I swear I’ll shut up about it?”  Perhaps you want to know what Mindy thinks makes a great best friend (someone who will fill your prescription in the middle of the night), or what makes a great guy (one who is aware of all elderly people in any room at any time and acts accordingly), or what is the perfect amount of fame (so famous you can never get convicted of murder in a court of law), or how to maintain a trim figure (you will not find that information in these pages). If so, you’ve come to the right book, mostly! In Is Everyone Hanging Out Without Me?, Mindy invites readers on a tour of her life and her unscientific observations on romance, friendship, and Hollywood, with several conveniently placed stopping points for you to run errands and make phone calls. Mindy Kaling really is just a Girl Next Door—not so much literally anywhere in the continental United States, but definitely if you live in India or Sri Lanka. ...more"},
{"title": "Fellside", "product_description": "The unmissable and highly anticipated new literary thriller from the author of the international phenomenon The Girl With All the Gifts. Fellside is a maximum security prison on the edge of the Yorkshire Moors. It's not the kind of place you'd want to end up. But it's where Jess Moulson could be spending the rest of her life. It's a place where even the walls whisper. And The unmissable and highly anticipated new literary thriller from the author of the international phenomenon The Girl With All the Gifts. Fellside is a maximum security prison on the edge of the Yorkshire Moors. It's not the kind of place you'd want to end up. But it's where Jess Moulson could be spending the rest of her life. It's a place where even the walls whisper. And one voice belongs to a little boy with a message for Jess.Will she listen? ...more"},
{"title": "Lean In: Women, Work, and the Will to Lead", "product_description": "Sheryl Sandberg’s Lean In is a massive cultural phenomenon and its title has become an instant catchphrase for empowering women. The book soared to the top of bestseller lists internationally, igniting global conversations about women and ambition. Sandberg packed theatres, dominated opinion pages, appeared on every major television show and on the cover of Time magazine, Sheryl Sandberg’s Lean In is a massive cultural phenomenon and its title has become an instant catchphrase for empowering women. The book soared to the top of bestseller lists internationally, igniting global conversations about women and ambition. Sandberg packed theatres, dominated opinion pages, appeared on every major television show and on the cover of Time magazine, and sparked ferocious debate about women and leadership.Ask most women whether they have the right to equality at work and the answer will be a resounding yes, but ask the same women whether they'd feel confident asking for a raise, a promotion, or equal pay, and some reticence creeps in.The statistics, although an improvement on previous decades, are certainly not in women's favour – of 197 heads of state, only twenty-two are women. Women hold just 20 percent of seats in parliaments globally, and in the world of big business, a meagre eighteen of the Fortune 500 CEOs are women.In Lean In, Sheryl Sandberg – Facebook COO and one of Fortune magazine's Most Powerful Women in Business – draws on her own experience of working in some of the world's most successful businesses and looks at what women can do to help themselves, and make the small changes in their life that can effect change on a more universal scale. ...more"},
{"title": "Morning Star (Red Rising #3)", "product_description": "Darrow would have lived in peace, but his enemies brought him war. The Gold overlords demanded his obedience, hanged his wife, and enslaved his people. But Darrow is determined to fight back. Risking everything to transform himself and breach Gold society, Darrow has battled to survive the cutthroat rivalries that breed Society's mightiest warriors, climbed the ranks, and Darrow would have lived in peace, but his enemies brought him war. The Gold overlords demanded his obedience, hanged his wife, and enslaved his people. But Darrow is determined to fight back. Risking everything to transform himself and breach Gold society, Darrow has battled to survive the cutthroat rivalries that breed Society's mightiest warriors, climbed the ranks, and waited patiently to unleash the revolution that will tear the hierarchy apart from within.Finally, the time has come.But devotion to honor and hunger for vengeance run deep on both sides. Darrow and his comrades-in-arms face powerful enemies without scruple or mercy. Among them are some Darrow once considered friends. To win, Darrow will need to inspire those shackled in darkness to break their chains, unmake the world their cruel masters have built, and claim a destiny too long denied - and too glorious to surrender. ...more"},
{"title": "Life After Life", "product_description": "On a cold and snowy night in 1910, Ursula Todd is born, the third child of a wealthy English banker and his wife. Sadly, she dies before she can draw her first breath. On that same cold and snowy night, Ursula Todd is born, lets out a lusty wail, and embarks upon a life that will be, to say the least, unusual. For as she grows, she also dies, repeatedly, in any number of w On a cold and snowy night in 1910, Ursula Todd is born, the third child of a wealthy English banker and his wife. Sadly, she dies before she can draw her first breath. On that same cold and snowy night, Ursula Todd is born, lets out a lusty wail, and embarks upon a life that will be, to say the least, unusual. For as she grows, she also dies, repeatedly, in any number of ways. Clearly history (and Kate Atkinson) have plans for her: In Ursula rests nothing less than the fate of civilization.Wildly inventive, darkly comic, startlingly poignant — this is Kate Atkinson at her absolute best, playing with time and history, telling a story that is breathtaking for both its audacity and its endless satisfactions. ...more"},
{"title": "One for the Money (Stephanie Plum #1)", "product_description": "Pestered by her close New Jersey family, Stephanie Plum offers to catch high-school crush Joe Morelli, cop turned bail jumper, for her cousin Vinnie's company. She questions working girls to find the missing girlfriend of vicious prizefighter Benito Ramirez while Joe secretly watches her back. Ranger mentors her and supplies vehicles when hers explode."},
{"title": "Orange Is the New Black", "product_description": "With a career, a boyfriend, and a loving family, Piper Kerman barely resembles the reckless young woman who delivered a suitcase of drug money ten years before. But that past has caught up with her. Convicted and sentenced to fifteen months at the infamous federal correctional facility in Danbury, Connecticut, the well-heeled Smith College alumna is now inmate #11187–424 — With a career, a boyfriend, and a loving family, Piper Kerman barely resembles the reckless young woman who delivered a suitcase of drug money ten years before. But that past has caught up with her. Convicted and sentenced to fifteen months at the infamous federal correctional facility in Danbury, Connecticut, the well-heeled Smith College alumna is now inmate #11187–424 — one of the millions of people who disappear “down the rabbit hole” of the American penal system. From her first strip search to her final release, Kerman learns to navigate this strange world with its strictly enforced codes of behavior and arbitrary rules. She meets women from all walks of life, who surprise her with small tokens of generosity, hard words of wisdom, and simple acts of acceptance. Heartbreaking, hilarious, and at times enraging, Kerman’s story offers a rare look into the lives of women in prison—why it is we lock so many away and what happens to them when they’re there. ...more"},
{"title": "The Demon-Haunted World: Science as a Candle in the Dark", "product_description": "How can we make intelligent decisions about our increasingly technology-driven lives if we don't understand the difference between the myths of pseudoscience and the testable hypotheses of science? Pulitzer Prize-winning author and distinguished astronomer Carl Sagan argues that scientific thinking is critical not only to the pursuit of truth but to the very well-being of How can we make intelligent decisions about our increasingly technology-driven lives if we don't understand the difference between the myths of pseudoscience and the testable hypotheses of science? Pulitzer Prize-winning author and distinguished astronomer Carl Sagan argues that scientific thinking is critical not only to the pursuit of truth but to the very well-being of our democratic institutions.Casting a wide net through history and culture, Sagan examines and authoritatively debunks such celebrated fallacies of the past as witchcraft, faith healing, demons, and UFOs. And yet, disturbingly, in today's so-called information age, pseudoscience is burgeoning with stories of alien abduction, channeling past lives, and communal hallucinations commanding growing attention and respect. As Sagan demonstrates with lucid eloquence, the siren song of unreason is not just a cultural wrong turn but a dangerous plunge into darkness that threatens our most basic freedoms. ...more"},
{"title": "The Book Thief", "product_description": "It’s just a small story really, about among other things: a girl, some words, an accordionist, some fanatical Germans, a Jewish fist-fighter, and quite a lot of thievery. . . .Set during World War II in Germany, Markus Zusak’s groundbreaking new novel is the story of Liesel Meminger, a foster girl living outside of Munich. Liesel scratches out a meager existence for hersel It’s just a small story really, about among other things: a girl, some words, an accordionist, some fanatical Germans, a Jewish fist-fighter, and quite a lot of thievery. . . .Set during World War II in Germany, Markus Zusak’s groundbreaking new novel is the story of Liesel Meminger, a foster girl living outside of Munich. Liesel scratches out a meager existence for herself by stealing when she encounters something she can’t resist–books. With the help of her accordion-playing foster father, she learns to read and shares her stolen books with her neighbors during bombing raids as well as with the Jewish man hidden in her basement before he is marched to Dachau.This is an unforgettable story about the ability of books to feed the soul. ...more"},
{"title": "Shopaholic & Baby (Shopaholic #5)", "product_description": "Becky Brandon (nee Bloomwood) is pregnant! She couldn't be more overjoyed-especially since discovering that shopping cures morning sickness. Everything has got to be perfect for her baby: from the designer nursery . . . to the latest, coolest pram . . . to the celebrity, must-have obstetrician. But when the celebrity obstetrician turns out to be her husband Luke's glamorou Becky Brandon (nee Bloomwood) is pregnant! She couldn't be more overjoyed-especially since discovering that shopping cures morning sickness. Everything has got to be perfect for her baby: from the designer nursery . . . to the latest, coolest pram . . . to the celebrity, must-have obstetrician. But when the celebrity obstetrician turns out to be her husband Luke's glamorous, intellectual ex-girlfriend, Becky's perfect world starts to crumble. She's shopping for two . . . but are there three in her marriage? ...more"},
{"title": "Packing for Mars: The Curious Science of Life in the Void", "product_description": "The best-selling author of Stiff and Bonk explores the irresistibly strange universe of space travel and life without gravity. Space is a world devoid of the things we need to live and thrive: air, gravity, hot showers, fresh produce, privacy, beer. Space exploration is in some ways an exploration of what it means to be human. How much can a person give up? How much weirdn The best-selling author of Stiff and Bonk explores the irresistibly strange universe of space travel and life without gravity. Space is a world devoid of the things we need to live and thrive: air, gravity, hot showers, fresh produce, privacy, beer. Space exploration is in some ways an exploration of what it means to be human. How much can a person give up? How much weirdness can they take? What happens to you when you can’t walk for a year? have sex? smell flowers? What happens if you vomit in your helmet during a space walk? Is it possible for the human body to survive a bailout at 17,000 miles per hour? To answer these questions, space agencies set up all manner of quizzical and startlingly bizarre space simulations. As Mary Roach discovers, it’s possible to preview space without ever leaving Earth. From the space shuttle training toilet to a crash test of NASA’s new space capsule (cadaver filling in for astronaut), Roach takes us on a surreally entertaining trip into the science of life in space and space on Earth. ...more"},
{"title": "The Girl Who Played with Fire (Millennium Trilogy #2)", "product_description": "Mikael Blomkvist, crusading journalist and publisher of the magazine Millennium, has decided to run a story that will expose an extensive sex trafficking operation between Eastern Europe and Sweden, implicating well-known and highly placed members of Swedish society, business, and government.But he has no idea just how explosive the story will be until, on the eve of publi Mikael Blomkvist, crusading journalist and publisher of the magazine Millennium, has decided to run a story that will expose an extensive sex trafficking operation between Eastern Europe and Sweden, implicating well-known and highly placed members of Swedish society, business, and government.But he has no idea just how explosive the story will be until, on the eve of publication, the two investigating reporters are murdered. And even more shocking for Blomkvist: the fingerprints found on the murder weapon belong to Lisbeth Salander—the troubled, wise-beyond-her-years genius hacker who came to his aid in The Girl with the Dragon Tattoo, and who now becomes the focus and fierce heart of The Girl Who Played with Fire.As Blomkvist, alone in his belief in Salander’s innocence, plunges into an investigation of the slayings, Salander herself is drawn into a murderous hunt in which she is the prey, and which compels her to revisit her dark past in an effort to settle with it once and for all. ...more"},
{"title": "The Giver (The Giver Quartet #1)", "product_description": "Featuring photographic artwork from the feature film on the cover, this handsome edition of The Giver is perfect for fans of the movie and the literary classic. Lois Lowry's 1994 Newbery Medal–winning tale has become one of the most influential novels of our time. The haunting story centers on Jonas who lives in a seemingly ideal, if colorless, world of conformity and cont Featuring  photographic artwork from the feature film on the cover, this handsome edition of The Giver  is  perfect for fans of the movie and the  literary classic. Lois Lowry's 1994 Newbery Medal–winning tale has become one of the most influential novels of our time. The haunting story centers on  Jonas who lives in a seemingly ideal, if colorless, world of conformity and contentment. Not until he is given his life assignment as the Receiver of Memory does he begin to understand the dark, complex secrets behind his fragile community. Lois Lowry has written three companion novels to The Giver, including Gathering Blue, Messenger, and Son. ...more"},
{"title": "Quiet: The Power of Introverts in a World That Can't Stop Talking", "product_description": "At least one-third of the people we know are introverts. They are the ones who prefer listening to speaking, reading to partying; who innovate and create but dislike self-promotion; who favor working on their own over brainstorming in teams. Although they are often labeled quiet, it is to introverts that we owe many of the great contributions to society--from van Gogh’s At least one-third of the people we know are introverts. They are the ones who prefer listening to speaking, reading to partying; who innovate and create but dislike self-promotion; who favor working on their own over brainstorming in teams. Although they are often labeled quiet, it is to introverts that we owe many of the great contributions to society--from van Gogh’s sunflowers to the invention of the personal computer.Passionately argued, impressively researched, and filled with indelible stories of real people, Quiet shows how dramatically we undervalue introverts, and how much we lose in doing so. Taking the reader on a journey from Dale Carnegie’s birthplace to Harvard Business School, from a Tony Robbins seminar to an evangelical megachurch, Susan Cain charts the rise of the Extrovert Ideal in the twentieth century and explores its far-reaching effects. She talks to Asian-American students who feel alienated from the brash, backslapping atmosphere of American schools. She questions the dominant values of American business culture, where forced collaboration can stand in the way of innovation, and where the leadership potential of introverts is often overlooked. And she draws on cutting-edge research in psychology and neuroscience to reveal the surprising differences between extroverts and introverts.Perhaps most inspiring, she introduces us to successful introverts--from a witty, high-octane public speaker who recharges in solitude after his talks, to a record-breaking salesman who quietly taps into the power of questions. Finally, she offers invaluable advice on everything from how to better negotiate differences in introvert-extrovert relationships to how to empower an introverted child to when it makes sense to be a pretend extrovert.This extraordinary book has the power to permanently change how we see introverts and, equally important, how introverts see themselves. ...more"},
{"title": "The Autobiography of Malcolm X", "product_description": "From hustling, drug addiction and armed violence in America's black ghettos Malcolm X turned, in a dramatic prison conversion, to the puritanical fervour of the Black Muslims. As their spokesman he became identified in the white press as a terrifying teacher of race hatred; but to his direct audience, the oppressed American blacks, he brought hope and self-respect. This au From hustling, drug addiction and armed violence in America's black ghettos Malcolm X turned, in a dramatic prison conversion, to the puritanical fervour of the Black Muslims. As their spokesman he became identified in the white press as a terrifying teacher of race hatred; but to his direct audience, the oppressed American blacks, he brought hope and self-respect. This autobiography (written with Alex Haley) reveals his quick-witted integrity, usually obscured by batteries of frenzied headlines, and the fierce idealism which led him to reject both liberal hypocrisies and black racialism.Vilified by his critics as an anti-white demagogue, Malcolm X gave a voice to unheard African-Americans, bringing them pride, hope and fearlessness, and remains an inspirational and controversial figure. ...more"},
{"title": "Paradise Lost (Paradise #1)", "product_description": "‘Better to reign in Hell, than serve in Heav’n …’In Paradise Lost, Milton produced a poem of epic scale, conjuring up a vast, awe-inspiring cosmos and ranging across huge tracts of space and time. And yet, in putting a charismatic Satan and naked Adam and Eve at the centre of this story, he also created an intensely human tragedy on the Fall of Man. Written when Milton was ‘Better to reign in Hell, than serve in Heav’n …’In Paradise Lost, Milton produced a poem of epic scale, conjuring up a vast, awe-inspiring cosmos and ranging across huge tracts of space and time. And yet, in putting a charismatic Satan and naked Adam and Eve at the centre of this story, he also created an intensely human tragedy on the Fall of Man. Written when Milton was in his fifties – blind, bitterly disappointed by the Restoration and briefly in danger of execution – Paradise Lost’s apparent ambivalence towards authority has led to intense debate about whether it manages to ‘justify the ways of God to men’, or exposes the cruelty of Christianity.John Leonard’s revised edition of Paradise Lost contains full notes, elucidating Milton’s biblical, classical and historical allusions and discussing his vivid, highly original use of language and blank verse. ...more"},
{"title": "The Name of the Wind (The Kingkiller Chronicle #1)", "product_description": "Told in Kvothe's own voice, this is the tale of the magically gifted young man who grows to be the most notorious wizard his world has ever seen. The intimate narrative of his childhood in a troupe of traveling players, his years spent as a near-feral orphan in a crime-ridden city, his daringly brazen yet successful bid to enter a legendary school of magic, and his life as Told in Kvothe's own voice, this is the tale of the magically gifted young man who grows to be the most notorious wizard his world has ever seen. The intimate narrative of his childhood in a troupe of traveling players, his years spent as a near-feral orphan in a crime-ridden city, his daringly brazen yet successful bid to enter a legendary school of magic, and his life as a fugitive after the murder of a king form a gripping coming-of-age story unrivaled in recent literature. A high-action story written with a poet's hand, The Name of the Wind is a masterpiece that will transport readers into the body and mind of a wizard. ...more"},
{"title": "On the Road (Duluoz Legend)", "product_description": "On the Road chronicles Jack Kerouac's years traveling the North American continent with his friend Neal Cassady, a sideburned hero of the snowy West. As Sal Paradise and Dean Moriarty, the two roam the country in a quest for self-knowledge and experience. Kerouac's love of America, his compassion for humanity, and his sense of language as jazz combine to make On the On the Road chronicles Jack Kerouac's years traveling the North American continent with his friend Neal Cassady, a sideburned hero of the snowy West. As Sal Paradise and Dean Moriarty, the two roam the country in a quest for self-knowledge and experience. Kerouac's love of America, his compassion for humanity, and his sense of language as jazz combine to make On the Road an inspirational work of lasting importance.Kerouac's classic novel of freedom and longing defined what it meant to be Beat and has inspired every generation since its initial publication. ...more"},
{"title": "Shatter Me (Shatter Me #1)", "product_description": "I have a curseI have a giftI am a monsterI'm more than humanMy touch is lethalMy touch is powerI am their weaponI will fight backJuliette hasn’t touched anyone in exactly 264 days.The last time she did, it was an accident, but The Reestablishment locked her up for murder. No one knows why Juliette’s touch is fatal. As long as she doesn’t hurt anyone else, no one really car I have a curseI have a giftI am a monsterI'm more than humanMy touch is lethalMy touch is powerI am their weaponI will fight backJuliette hasn’t touched anyone in exactly 264 days.The last time she did, it was an accident, but The Reestablishment locked her up for murder. No one knows why Juliette’s touch is fatal. As long as she doesn’t hurt anyone else, no one really cares. The world is too busy crumbling to pieces to pay attention to a 17-year-old girl. Diseases are destroying the population, food is hard to find, birds don’t fly anymore, and the clouds are the wrong color.The Reestablishment said their way was the only way to fix things, so they threw Juliette in a cell. Now so many people are dead that the survivors are whispering war – and The Reestablishment has changed its mind. Maybe Juliette is more than a tortured soul stuffed into a poisonous body. Maybe she’s exactly what they need right now.Juliette has to make a choice: Be a weapon. Or be a warrior. ...more"},
{"title": "Taking Shots (Assassins #1)", "product_description": "Elli Fisher has never thought she was good enough, let it be her job, her weight, her love life, nothing. That is until she meets Shea Adler. After doing a promotional shoot for the NHL team, the Assassins, she meets the hunky hockey player who shoots a puck, shattering her world.Shea Adler was tired of the life he was living outside of the rink. The girls, the money blowi Elli Fisher has never thought she was good enough, let it be her job, her weight, her love life, nothing. That is until she meets Shea Adler. After doing a promotional shoot for the NHL team, the Assassins, she meets the hunky hockey player who shoots a puck, shattering her world.Shea Adler was tired of the life he was living outside of the rink. The girls, the money blowing, the drinking, everything had to stop and it all did when he met Eleanor Fisher. He had never met anyone like her. She was feisty, witty, shy, and simply gorgeous. When he laid eyes on her, it was as if he was taking the hardest hit of his life into the boards, and he had to have her. Elli is a little skeptical of Shea, but he knows that they were meant to be together, and he needed her in his life. Can Elli throw her insecurities out the window and love Shea with everything inside of her, or will she let a past relationship, and her family ruin any chance of her being happy. ...more"},
{"title": "The Zombie Room", "product_description": "An unlikely bond is forged between three men from very different backgrounds when they serve time together in prison. A series of wrong turns and disastrous life choices has led to their incarceration. Following their release, Mangle, Decker and Tazeem stick together as they return to a life of crime, embarking on a lucrative scam. But when they stumble upon a sophisticate An unlikely bond is forged between three men from very different backgrounds when they serve time together in prison. A series of wrong turns and disastrous life choices has led to their incarceration. Following their release, Mangle, Decker and Tazeem stick together as they return to a life of crime, embarking on a lucrative scam. But when they stumble upon a sophisticated sex-trafficking operation, they soon realise that they are in mortal danger. The disappearance of a family member and the murder of a dear friend lead the three to delve deeper into a world of violence and deception. In their quest for retribution and justice, they put their lives on the line. Their paths cross with that of Tatiana, who has left her home country for a better life in the West - or so she thinks. She soon realises she is in the hands of ruthless, violent people, who run an operation supplying girls to meet the most deviant desires of rich and powerful men. Will she survive the horrors of The Zombie Room? Are Mangle, Decker and Tazeem brave enough to follow her there, in an attempt to set her free? ...more"},
{"title": "Frankenstein", "product_description": "Mary Shelley began writing Frankenstein when she was only eighteen. At once a Gothic thriller, a passionate romance, and a cautionary tale about the dangers of science, Frankenstein tells the story of committed science student Victor Frankenstein. Obsessed with discovering the cause of generation and life and bestowing animation upon lifeless matter, Frankenstein assembles Mary Shelley began writing Frankenstein when she was only eighteen. At once a Gothic thriller, a passionate romance, and a cautionary tale about the dangers of science, Frankenstein tells the story of committed science student Victor Frankenstein. Obsessed with discovering the cause of generation and life and bestowing animation upon lifeless matter, Frankenstein assembles a human being from stolen body parts but; upon bringing it to life, he recoils in horror at the creature's hideousness. Tormented by isolation and loneliness, the once-innocent creature turns to evil and unleashes a campaign of murderous revenge against his creator, Frankenstein.Frankenstein, an instant bestseller and an important ancestor of both the horror and science fiction genres, not only tells a terrifying story, but also raises profound, disturbing questions about the very nature of life and the place of humankind within the cosmos: What does it mean to be human? What responsibilities do we have to each other? How far can we go in tampering with Nature? In our age, filled with news of organ donation genetic engineering, and bio-terrorism, these questions are more relevant than ever. ...more"},
{"title": "Jane Eyre", "product_description": "Orphaned into the household of her Aunt Reed at Gateshead, subject to the cruel regime at Lowood charity school, Jane Eyre nonetheless emerges unbroken in spirit and integrity. She takes up the post of governess at Thornfield, falls in love with Mr. Rochester, and discovers the impediment to their lawful marriage in a story that transcends melodrama to portray a woman's pa Orphaned into the household of her Aunt Reed at Gateshead, subject to the cruel regime at Lowood charity school, Jane Eyre nonetheless emerges unbroken in spirit and integrity. She takes up the post of governess at Thornfield, falls in love with Mr. Rochester, and discovers the impediment to their lawful marriage in a story that transcends melodrama to portray a woman's passionate search for a wider and richer life than Victorian society traditionally allowed.With a heroine full of yearning, the dangerous secrets she encounters, and the choices she finally makes, Charlotte Bronte's innovative and enduring romantic novel continues to engage and provoke readers. ...more"},
{"title": "A Visit from the Goon Squad", "product_description": "Bennie is an aging former punk rocker and record executive. Sasha is the passionate, troubled young woman he employs. Here Jennifer Egan brilliantly reveals their pasts, along with the inner lives of a host of other characters whose paths intersect with theirs. With music pulsing on every page, A Visit from the Goon Squad is a startling, exhilarating novel of self-destruct Bennie is an aging former punk rocker and record executive. Sasha is the passionate, troubled young woman he employs. Here Jennifer Egan brilliantly reveals their pasts, along with the inner lives of a host of other characters whose paths intersect with theirs. With music pulsing on every page, A Visit from the Goon Squad is a startling, exhilarating novel of self-destruction and redemption. ...more"},
{"title": "Breaking Dawn (Twilight #4)", "product_description": "When you loved the one who was killing you, it left you no options. How could you run, how could you fight, when doing so would hurt that beloved one? If your life was all you had to give, how could you not give it? If it was someone you truly loved?--To be irrevocably in love with a vampire is both fantasy and nightmare woven into a dangerously heightened reality for Bell When you loved the one who was killing you, it left you no options. How could you run, how could you fight, when doing so would hurt that beloved one? If your life was all you had to give, how could you not give it? If it was someone you truly loved?--To be irrevocably in love with a vampire is both fantasy and nightmare woven into a dangerously heightened reality for Bella Swan. Pulled in one direction by her intense passion for Edward Cullen, and in another by her profound connection to werewolf Jacob Black, she has endured a tumultuous year of temptation, loss, and strife to reach the ultimate turning point. Her imminent choice to either join the dark but seductive world of immortals or to pursue a fully human life has become the thread from which the fates of two tribes hangs.Now that Bella has made her decision, a startling chain of unprecedented events is about to unfold with potentially devastating and unfathomable, consequences. Just when the frayed strands of Bella's life - first discovered in Twilight, then scattered and torn in New Moon and Eclipse - seem ready to heal and knit together, could they be destroyed... forever? ...more"},
{"title": "Dark Places", "product_description": "FROM THE #1 NEW YORK TIMES BESTSELLING AUTHOR OF GONE GIRLLibby Day was seven when her mother and two sisters were murdered in “The Satan Sacrifice of Kinnakee, Kansas.” She survived—and famously testified that her fifteen-year-old brother, Ben, was the killer. Twenty-five years later, the Kill Club—a secret secret society obsessed with notorious crimes—locates Libby and FROM THE #1 NEW YORK TIMES BESTSELLING AUTHOR OF GONE GIRLLibby Day was seven when her mother and two sisters were murdered in “The Satan Sacrifice of Kinnakee, Kansas.” She survived—and famously testified that her fifteen-year-old brother, Ben, was the killer. Twenty-five years later, the Kill Club—a secret secret society obsessed with notorious crimes—locates Libby and pumps her for details. They hope to discover proof that may free Ben. Libby hopes to turn a profit off her tragic history: She’ll reconnect with the players from that night and report her findings to the club—for a fee. As Libby’s search takes her from shabby Missouri strip clubs to abandoned Oklahoma tourist towns, the unimaginable truth emerges, and Libby finds herself right back where she started—on the run from a killer. ...more"},
{"title": "Beautiful Creatures (Caster Chronicles #1)", "product_description": "Lena Duchannes is unlike anyone the small Southern town of Gatlin has ever seen, and she's struggling to conceal her power, and a curse that has haunted her family for generations. But even within the overgrown gardens, murky swamps and crumbling graveyards of the forgotten South, a secret cannot stay hidden forever.Ethan Wate, who has been counting the months until he can Lena Duchannes is unlike anyone the small Southern town of Gatlin has ever seen, and she's struggling to conceal her power, and a curse that has haunted her family for generations. But even within the overgrown gardens, murky swamps and crumbling graveyards of the forgotten South, a secret cannot stay hidden forever.Ethan Wate, who has been counting the months until he can escape from Gatlin, is haunted by dreams of a beautiful girl he has never met. When Lena moves into the town's oldest and most infamous plantation, Ethan is inexplicably drawn to her and determined to uncover the connection between them.In a town with no surprises, one secret could change everything. ...more"}
]